{"0": {"name": "Cody Jazzman", "comment_text": "How'd you end up here? Did you spell \"DuckDuckGo.com\" incorrectly?"}, "1": {"name": "Johan Slåttavik", "comment_text": "I don’t like Google. They steal and abuse the users information."}, "2": {"name": "Agent Mo", "comment_text": "\"Don't be Evil\" is not google's slogan anymore"}, "3": {"name": "Reagan the GOAT", "comment_text": "DuckDuckGo"}, "4": {"name": "Nodsaibot", "comment_text": "They recently removed \"Don't be evil\" from their company statement, now that's telling"}, "5": {"name": "Till", "comment_text": "I think you just misstyped duckduckgo.com"}, "6": {"name": "CommentLlama", "comment_text": "use DuckDuckgo.com instead"}, "7": {"name": "6String69", "comment_text": "https://duckduckgo.com/"}, "8": {"name": "Xbox", "comment_text": "duckduckgo.com is better"}, "9": {"name": "Catherine", "comment_text": "Google is discriminating against Christians, it no longer makes note of Christian holidays on its title page, but it makes note of Muslim holy days. It is anti American. It no longer makes note of American holidays like Memorial day. It censors free speech. It buries searches, or shows negative results for President Trump and his supporters. Google is part of the Big Brother corporate mind control system."}, "10": {"name": "Caleb McDonald", "comment_text": "Better (and more secure) options for you are DuckDuckGo or StartPage!"}, "11": {"name": "Professor Ron", "comment_text": "Oh this extension tool is dope. This changes the game. I like duckduckgo as well."}, "12": {"name": "TheGreatRoh", "comment_text": "Use duckduckgo. Google is communist."}, "13": {"name": "JoeBlue", "comment_text": "DuckDuckGo is a billion times better"}, "14": {"name": "Nathan", "comment_text": "I can't wait till Google puts up another one of those SJW Google Doodles. We are going to tear them a new one with Dissenter, lol."}, "15": {"name": "Hobgob", "comment_text": "www.duckduckgo.com"}, "16": {"name": "Malcolm Rose", "comment_text": "Welcome to the homepage of a disgusting monopoly which seeks to crush American values such as freedom of speech. Google is run by political extremists who want to cut your tongue out of your mouth.\nhttps://www.youtube.com/watch?v=pHGMOmwLIHQ\nWAYS TO DEFANG GOOGLE:\nDon't use Google. Use DuckDuckGo. It is a search engine that doesn't track you.\nDon't use Chrome. Use Brave. It is a browser that doesn't track you: https://brave.com/ros383"}, "17": {"name": "Wartcluster", "comment_text": "Very evil. Use DuckDuckGo instead."}, "18": {"name": "Kojima A.", "comment_text": "If you want a better search engine, try http://duckduckgo.com/"}, "19": {"name": "OddAntlers", "comment_text": "use duckduckgo.com instead"}, "20": {"name": "Graham Arbi", "comment_text": "https://duckduckgo.com"}, "21": {"name": "DeusExMachinaPrime", "comment_text": "DuckDuckGo"}, "22": {"name": "Chilean Helicopter Pilot", "comment_text": "Happy international screeching harpy day.\nNow get back in the kitchen."}, "23": {"name": "pivac", "comment_text": "www.duckduckgo.com"}, "24": {"name": "Hans Lysglimt Johansen", "comment_text": "Dont be evil!"}, "25": {"name": "skeezix", "comment_text": "First time in months I've been on google search, and it's just to see the Dissenter comments! Back to DuckDuckGo now."}, "26": {"name": "Skylar Thomas", "comment_text": "hey Google... don't be evil... ✔"}, "27": {"name": "MrJoy", "comment_text": "It's very refreshing to be able to comment freely on google.com - and to see that the other comments shown actually seem like normal, mentally healthy people even when there's no cencorship."}, "28": {"name": "Guy Grune", "comment_text": "You're looking at the homepage of a company in terrible need of anti-trust enforcement."}, "29": {"name": "PineappleZombie", "comment_text": "I prefer duckduckgo"}, "30": {"name": "John Smith ⭐⭐⭐", "comment_text": "Install the Adnauseam plugin. It's a Google killer. It blocks ads, and then clicks on them in the background to cost advertisers money. Drive advertisers off the internet. https://adnauseam.io"}, "31": {"name": "Chadwick Eisman", "comment_text": "google still has its uses....using duckduckgo has been a awesome experience besides load time, some stuff doesn't load at all... to be honest, not that anyone cares....i haven't made a alt email address so far, that is on my list of things to do #duckduckgo #google #search #searchengine #email #dapp #dapps #decentralized"}, "32": {"name": "podex", "comment_text": "Oh look, another Doodle celebrating women."}, "33": {"name": "Kippykip", "comment_text": "inb4 dissenter removed from chrome store"}, "34": {"name": "AgentSmith", "comment_text": "DUCKDUCKgo IT !!"}, "35": {"name": "Czechoslovak", "comment_text": "Don't Be Evil."}, "36": {"name": "TrumpClone", "comment_text": "Google are authoritarian tyrants. Stop using Google, Chrome, Gmail etc. And stop using default Android and install LineageOS without Gapps."}, "37": {"name": "Josh", "comment_text": "Google hid the suggested search phase \"Hillary Clinton's health issues\" during the 2016 election."}, "38": {"name": "Ashfoot", "comment_text": "www.duckduckgo.com"}, "39": {"name": "Merthurian", "comment_text": "Goolag"}, "40": {"name": "H-Wood", "comment_text": "Whose black feminist birthday is it today? Find out only at Google."}, "41": {"name": "Erik", "comment_text": "Google hates free speech. They want to be \"the good censor\". They are run by an immigrant who doesn't appreciate free speech as both a value and a right."}, "42": {"name": "Leonardo Rodrigues", "comment_text": "Evil starts here!"}, "43": {"name": "DrStrangelove", "comment_text": "Don’t be google..."}, "44": {"name": "mrnone", "comment_text": "dont feed the google and it will die"}, "45": {"name": "Joe Schmo", "comment_text": "don't track me bro"}, "46": {"name": "T", "comment_text": "google sucks"}, "47": {"name": "Butt Diarrhea", "comment_text": "What happened to \"Don't be evil\" you evil bastards"}, "48": {"name": "J. Michael", "comment_text": "duckduckgo.com"}, "49": {"name": "Truth Stab", "comment_text": "Use brave and duckduckgo. Google... I used to like you. But we're breaking up. Because you're a faggot. #fuckSocialism"}, "50": {"name": "AgentSmith", "comment_text": "LEARN TO CODE GOOGLE YOU BITCH !!!!"}, "51": {"name": "Jerald", "comment_text": "I've been trying my best to stop using all Google services, but it's hard to break the habit of typing google into the URL whenever I need to search for something. Use DuckDuckGo instead, everyone."}, "52": {"name": "Nathan Metzger", "comment_text": "Hey there person. I hope you have a good day."}, "53": {"name": "Peach Mint", "comment_text": "Fuck off, Google. Censor this."}, "54": {"name": "Nastaggio Gioia", "comment_text": "\"don't be evil\" \"be evil\"\nIFIFY bastards"}, "55": {"name": "Steven Work", "comment_text": "Here is Proof that Google Exec Lied under oath that they do not politically manipulate search results .. https://twitter.com/StevWork/status/1030230085943603205"}, "56": {"name": "Thomas", "comment_text": "Google is leftist, is globalist, and is censoring the free speech of Americans.\nGoogle is also trying to manipulate our elections. Google can no longer be trusted as an 'American' company, but also cannot be trusted at the basic level of their search results.\nIt's a shame. They were good for a while, but no longer."}, "57": {"name": "Thomas", "comment_text": "Isn't it great when you go to a major website on the internet and you are the first one to post on Dissenter?\nIt is a true honor to be a part of this exiting new technology."}, "58": {"name": "Thomas", "comment_text": "I'd imagine it must suck to work at Google knowing it used to be a great company, but now it is just evil.\nOne the bright side, at least most of the talented people already learned to code..."}, "59": {"name": "Thomas Shaw", "comment_text": "Google plays up its social justice warriors image, fight for equality and justice and oppression--at the same time they are developing a search engine for Chinese Communist government to oppress its citizens. Progressives who defend Google are either idiots or total hypocrites or both."}, "60": {"name": "Mashton82", "comment_text": "Bad luck Google I found Dissenter. A multi billion dollar company and you still can't hide your censorship. Lol. DISSENTER.COM. easy as that."}, "61": {"name": "hohoho", "comment_text": "Google is a disgusting company run by disgusting pigs."}, "62": {"name": "slask25", "comment_text": "Google \"white inventors\" and watch the image results. That tells you everything you need to know about the people that run google."}, "63": {"name": "evan reed", "comment_text": "Sub to pewdiepie, up vote to save him!"}, "64": {"name": "ConquerTheNarrative", "comment_text": "This neomarxist company censors everything outside of its leftist bubble. It will burst pretty soon. Can't wait."}, "65": {"name": "Thomas Shaw", "comment_text": "Google-owned video platform YouTube took down a video from Project Veritas showing a senior employee at the company appearing to admit that the company plans to interfere in the next presidential election to stop Donald Trump. https://www.breitbart.com/tech/2019/06/24/google-censors-video-exposing-google/"}, "66": {"name": "MJFrithjof", "comment_text": "Use DuckDuckGo or StartPage instead"}, "67": {"name": "RW", "comment_text": "www.qwant.com"}, "68": {"name": "Mud", "comment_text": "Censor this bitches."}, "69": {"name": "Emerson", "comment_text": "Wow, what a shit company Google is. \"Google Funds Establishment Conservatives to Fight Tech Regulation\""}, "70": {"name": "KB", "comment_text": "Just here to inform you sane folks on gab to ditch gulag and use duck.com"}, "71": {"name": "Citizen #17", "comment_text": "DuckDuckGo"}, "72": {"name": "Benjamin Popp", "comment_text": "Anyone ever stop to think how much Power the world Search Engine has?\nJust a Little Bit Scary...."}, "73": {"name": "gogzter mcall", "comment_text": "google sucks balls"}, "74": {"name": "SDsc0rch", "comment_text": "hey google..... LEARN TO CODE"}, "75": {"name": "sarah", "comment_text": "don't be evil"}, "76": {"name": "Gordon Gekko", "comment_text": "Long live James Damore!"}, "77": {"name": "Big John", "comment_text": "Everyone is recommending DuckDuckGo (which is my default) however Ive read its just a mix of Google, Yahoo, & Bing. If you compare results it does look to be the case. This means your DDG results have already been filtered and curated by the top search engines. We really need a new search engine that gives us honest results without any filtering."}, "78": {"name": "Bimmy_Lee", "comment_text": "People just use Duck Duck Go. The best search engine on the web."}, "79": {"name": "The Prisoner", "comment_text": "Censor this, fascists 🖕"}, "80": {"name": "Steven Jacks", "comment_text": "Google, a giant multi-national corporation with far too much power and influence and of course they use that power and influence to push left wing propaganda into the minds of millions. Just Google \"white couple\" and look at the image results."}, "81": {"name": "Mark", "comment_text": "This site is jacked up. Years ago I had several emails dedicated for certain things. Google \"overpowered\" and forced itself, not me to recognized one of those emails mandating that I use it. Its was not my primary email. Anyway, I abandoned Google long ago because of their attempts to \"force\" their will on me."}, "82": {"name": "David Westgate", "comment_text": "I changed my homepage from goolge to infowars lol get f#cked google"}, "83": {"name": "Josh", "comment_text": "Google is more interested in pressing cultural marxist agenda than providing a service. That's why I use duckduckgo instead. Google is evil."}, "84": {"name": "middleagemanwithanimepic", "comment_text": "what a surprise. they have a feminist doodle up right when captain marvel comes out. totally not propaganda at all!"}, "85": {"name": "Cyka Bjlatb", "comment_text": "Satan's favorite website"}, "86": {"name": "Greasy Tit", "comment_text": "google is run by nazi fags"}, "87": {"name": "Martin Be", "comment_text": "75th Anniversary of D-day today and faggy Google doesn't have a doodle about it. But a few days ago they were pushing faggety gay day or month or whatever. FOAD Google!"}, "88": {"name": "Dave Therave", "comment_text": "Just type in 'men can'"}, "89": {"name": "A spooky hippogryph", "comment_text": "Hey google, I will enjoy your tears when Trump wins 2020."}, "90": {"name": "Cigarette Smoking Man", "comment_text": "2004: Do no evil. 2019: No, do evil."}, "91": {"name": "OneBTS", "comment_text": "Communist assholes!"}, "92": {"name": "Legalize Murder", "comment_text": "these people are satan"}, "93": {"name": "Rock Lobster", "comment_text": "This is awesome lol"}, "94": {"name": "Thomas Müntzer", "comment_text": "http://www.ecosia.org"}, "95": {"name": "Pickled Cabbage", "comment_text": "This is a \"free\" search engine that is used to sculpt public opinion by manipulating the results of any politically sensitive search. Long gone are the days of objectively relevant results. You are going to eat your propaganda, and then you're going to google \"how can I eat a second helping of propaganda?\"\nBurn this shit to the ground and make something open source; something that has results that can be objectively verified to be produced via an algorithm that produces a genuinely relevant result... and not something that the CIA wishes to shovel on the population. The market demands it."}, "96": {"name": "Jon Creasy", "comment_text": "Buy Bitcoin."}, "97": {"name": "Harold Crews", "comment_text": "Don't be a cog in Google's machine."}, "98": {"name": "Robert", "comment_text": "How to use the internet.\nStep 1: Download Brave Browser\nStep 2: Download Dissenter\nStep 3: Change your search engine to DuckDuckGo or Bing"}, "99": {"name": "Purple", "comment_text": "better use duckduckgo or ecosia"}, "100": {"name": "Lord Pek", "comment_text": "Please make \"duckduckgo\" your final google.com search... you will thank me for this later."}, "101": {"name": "John D. Trolinger", "comment_text": "Be immortal they said. Type your life secrets into the white box. The slogan should be \"We Keep Everything.\""}, "102": {"name": "Rick Sanchez", "comment_text": "Current google staff (faggots) are against the very principles that helped start their company."}, "103": {"name": "Collton Righem", "comment_text": "Google? More like... JEWGLE!!111111!!11111111!!111!!!!!\ni'm here all night folks"}, "104": {"name": "Genome Editor", "comment_text": "When you search for this extension, Google doesn't find it but, instead, bombards you with MSM propaganda calling it \"far right\". LMAO Imagine my shock."}, "105": {"name": "john smith", "comment_text": "Google is censoring the results for Dissenter! They don't show the main website or places for download for me unless I type out the URL."}, "106": {"name": "DelyricOracle", "comment_text": "duckduckgo doesn't change their algorithms to control election outcomes, thought and control the world .... they're ... ya know... not evil. Use them."}, "107": {"name": "Funkymango", "comment_text": "Google is biased as they alter their search algorithm to make particular information from particular sources appear at the top of a page. For a simple test of bias search for 'nationalistic' using Google and 'Duck Duck Go'."}, "108": {"name": "Ghoulslime H Christ", "comment_text": "Just thought I'd let you know that DuckDuckGo is the way to go. Google is a SJW Nazi machine. Fuck you, you fascist motherfuckers!"}, "109": {"name": "Jordan B Petersonson", "comment_text": "Google is racist, sexist, discriminatory, abuses its power. If it were a physical entity, it would be a rapist, I fear."}, "110": {"name": "Idahoian", "comment_text": "Fuck Google and their shitskin agenda"}, "111": {"name": "Kill Commies", "comment_text": "Google is anti-white"}, "112": {"name": "Mike66", "comment_text": "Nothing to see here. Just a company that needs to be dissolved for serious transgressions against humankind."}, "113": {"name": "Thomas Shaw", "comment_text": "Google Denies Political Bias to the Senate, Just a day after more leaked documents — as well as undercover footage of a top company executive — exposed Google’s determination to never let an election result like 2016 happen again, Google’s representatives told a Senate hearing that the company considers itself a “neutral public forum.” https://www.breitbart.com/tech/2019/06/28/bokhari-google-denies-political-bias-to-the-senate-yes-really/"}, "114": {"name": "Mike Deaton", "comment_text": "fuck google"}, "115": {"name": "leoloyola", "comment_text": "Now what? Why are Dissenter comments only from one year ago?"}, "116": {"name": "Rogelioavilez", "comment_text": "Not here by mistake, I just came to add my Dissenter comment, Google could have been the greatest thing to human kind, Sadly Egomaniacs, Diabolic, and Demented people exist on this world. I don't wish bad to anyone, I just pray to GOD, Please give them clarity on their future. Humans are worth saving, just sometimes We need to see the evilness to understand our capabilities. GOOD, BAD, and WORST capabilities.\nfor more information go to:\nDUCK_DUCK_GO\nand please DUCK IT. (No more use of the phrase \"google it\" please people)"}, "117": {"name": "Jasha", "comment_text": "If you want Big Tech to manipulate and distort your search results, you came to the right place."}, "118": {"name": "AkumaRajio", "comment_text": "block this search result commie loving cunts!"}, "119": {"name": "Wizmo", "comment_text": "Love this! Sundar Pichai is a technocrat."}, "120": {"name": "Deedlit", "comment_text": "www.startpage.com"}, "121": {"name": "totalawedude", "comment_text": "i am currently commenting on the number one website. hi everyone! also @paul duckduckgo is better"}, "122": {"name": "DeusExHomines", "comment_text": "StartPage is a nice alternative"}, "123": {"name": "Thought Criminal Chameleon", "comment_text": "Right-Wing STRATEGY for 2019 - 4 PRODUCTIVE ACTIONS You Can Take https://www.youtube.com/watch?v=9EAllm0ssLw"}, "124": {"name": "A_Deplorable_USMOJO✝️v.4", "comment_text": "Read my mind about #GOOGLE -> 👉 DISSENTER 👈 🌧️⛈️ ❤️ ❄️ 🌵 🏆 🤠 🐎 🐄 🐷 🐓 🍩 🌭 🥤 🎵 🎤 💃🏾 🕺🏿 🦐 🐙 evil unGodly 👉 YEP 👈 🌧️⛈️ ❤️ ❄️ 🌵 💥 💥 💥 🏆 🤠 🐎 🐄 🐷 🐓 🍩 🌭 🥤 🎵 🎤 💃🏾 🕺🏿 🦐 🐙"}, "125": {"name": "Razanur", "comment_text": "Everything you need to know about Google: https://www.google.com/search?q=european+people+history&hl=en-BR&authuser=0&source=lnms&tbm=isch&sa=X&sqi=2&ved=0ahUKEwipr5eOrdvgAhVmEbkGHa-1DTQQ_AUIDigB"}, "126": {"name": "Tubed Stone", "comment_text": "Google... Don't be evil!!!"}, "127": {"name": "AlanV", "comment_text": "The 6 best privacy search engines are Duck Duck Go, Search Encrypt, Gibiru, Start Page, Qwant and Searx. If you still want another search engine other than Yahoo, Google or Bing then there is Yippy. Also there is 4conservative.com part a larger 4search network claiming to be for conservatives. And if you need a online email service away from Google and Yahoo then try mail.com."}, "128": {"name": "TV License Remover", "comment_text": "What is the Kalergi Plan?"}, "129": {"name": "Vidar Viking Elvigen", "comment_text": "No Google I like to have developer mode enabled in Chrome. But thanks for asking"}, "130": {"name": "Scott Wright", "comment_text": "I haven't used Google in a year but thought I'd visit to see what my fellow Dissenters had to say."}, "131": {"name": "Syrup", "comment_text": "Why not do a Google Image search for: \"European people history\"?"}, "132": {"name": "SDsc0rch", "comment_text": "GOOGLE SUCKS!! #GOOLAG #SOCIALISMKILLS"}, "133": {"name": "Web of Slime", "comment_text": "1984 is here. Google is hypertargeting you, as we speak."}, "134": {"name": "CloaklaTeeklin", "comment_text": "Duckduckgo.com They won't track you and sell your info!"}, "135": {"name": "D. T. Sparks", "comment_text": "Who else just came here to see what the Dissenter comments were like? lol"}, "136": {"name": "Shitlord Olafssen", "comment_text": "Google is a Jewish-run occult NWO front organisation. It appeared from nowhere and their search engine was initially no better than Alta Vista. Google used the classic bait-and-switch tactic of initially appearing to offer open search results, but has recently let its true colours show through mass manipulation and censorship of search results to suit its globalist anti-white agenda anti-family pro-sicko agenda.\nGoogle also did the same in mobile, by initially jumping onboard the work of others in the \"Open Handset Alliance\" whereby it initially appeared in favour of openness, but over time has made Android increasingly proprietary. Google has the power to take complete control of your phone and track you through the Google Play Services if they desire. Android phones also back-up all application data to Google's servers by default where no doubt your private data is mined and given to NWO operatives via the NSA. Google does not offer any other backup options.\nGoogle mines every single thing you type into the search box in their Chrome browser. Google intentionally does not easily allow you to select other search engines in its web browsers, most notable on mobile. Google cares so little about your privacy that if you visit their HQ in Mountain View you can see other peoples' private search results on a big public TV screen.\nThe solution to Google is not other, most likely controlled opposition, products like DuckDuckGo. Rather, the long-term solution is a web browser with integrated P2P web spider indexer as you browse."}, "137": {"name": "RocketJump", "comment_text": "Stop using Google. Use Startpage or Duck Duck Go, or anything but Google. Don't be evil !"}, "138": {"name": "The Mighty Minnesotan", "comment_text": "I use Qwant, never use Google, it has become a garbage search engine that can't even provide the simplest search results."}, "139": {"name": "AlexOrwell", "comment_text": "GOOLAG"}, "140": {"name": "kekistani_refugee", "comment_text": "CIA toadie Sergey Brin can eat my asshole."}, "141": {"name": "Agent Tiki", "comment_text": "Hey Google, go Duck yourself! DuckDuckGo!"}, "142": {"name": "YtheHorses", "comment_text": "Oh good grief, why am I on Google? This is ridiculous. I never use this. Use DuckDuckGo. MUCH BETTER. No more spying on you."}, "143": {"name": "wobbly", "comment_text": "I Dissent with Dissenter"}, "144": {"name": "Dave Star", "comment_text": "FU GOOGLE!"}, "145": {"name": "Storm Striker", "comment_text": "Get rid of your Chrome browser. Use a browser like Brave https://brave.com/download/"}, "146": {"name": "A Mildly Concerned Man", "comment_text": "Google.com is trying to obstruct dissenter.com by notifying you that installing the extension makes Chrome unsafe."}, "147": {"name": "The Mighty Minnesotan", "comment_text": "Hasn't been a real search engine for over 10 years."}, "148": {"name": "Renegade Operator", "comment_text": "Google. The official browser of \"Orange Man Bad! ReeeEEEEEEEEE!\""}, "149": {"name": "Freedom", "comment_text": "Very important article from Julian Assange, Google is a corrupt company with ties to politicians https://wikileaks.org/google-is-not-what-it-seems/"}, "150": {"name": "Chuck D", "comment_text": "google. only showing results they want you to see"}, "151": {"name": "Henrik 'Hedda' Wallin", "comment_text": "I recommend https://searx.me if you want to search for controversial subjects. https://duckduckgo.com is my default search engine though."}, "152": {"name": "Wehr Katze", "comment_text": "jewgle"}, "153": {"name": "Forrest Munden", "comment_text": "Google = bias"}, "154": {"name": "Shitlord Olafssen", "comment_text": "If you want any more evidence for Google's evil (not that you should need it), then search for gab dissenter on Google. dissenter.com does not show up on any results at all. Bing it and dissenter.com is result #1."}, "155": {"name": "Seneca the Shitlord", "comment_text": "Google is a Leftist Communist anti-white anti-male company that wants you broke or dead and your children raped and brainwashed. Do not give them your money and do not give them your data. They will use it to kill you and your family.\nduckduckgo.com"}, "156": {"name": "Heckmeck the first", "comment_text": "Left fascists website, called google.\nThey have weaponized the search engine for their agenda. You will only find the MSM they \"think\" is good for you. Wherever you go. Even on your weather page, via Google ads. You are constantly brainwashed by google. You shouldnt use it."}, "157": {"name": "The one that got away", "comment_text": "Oh, this is that censorship company."}, "158": {"name": "Blazin Saddles", "comment_text": "1984 warmed is of this."}, "159": {"name": "Michael Sabo", "comment_text": "Use DuckDuckgo.com they wont steal your information like google does."}, "160": {"name": "Em_cordel", "comment_text": "EVIL"}, "161": {"name": "Frickenclutch", "comment_text": "Dissenter will be a primary way to get all peoples of any kind of curiosity into the righteous platforms of ALT-tech. Imagine being on just the landing page of the earths biggest search engine, but a friend told you about the conversation that is occurring simultaneously. However you can't see it unless you get a GAB, Dissenter account. Watch parabolic growth, occur. Congratulations team !"}, "162": {"name": "Sean Stuart", "comment_text": "Quartz Countertops Orlando, FL by KB Surfaces and Supply\nCambria, Silestone, Caesarstone, & Compac Quartz Countertops in Orange County, FL\nOrlando, FL Quartz Kitchen Countertop, Kitchen & Bath Remodeling Experts.\nCountertops, Cabinets, & Flooring in Orlando, Fl\nhttps://kbsurfacesandsupply.com/"}, "163": {"name": "sanforce", "comment_text": "Google just conducted a study that showed men are systematically underpaid when compared to women doing the same job.\nGoogle then walked their own research back to push the leftist agenda that \"women are victimized by society.\"\nThere have been multiple studies showing that women are paid higher than their male peers.\nAbsurd leftist tech company!"}, "164": {"name": "jacod1", "comment_text": "Jewgle can suck my chode"}, "165": {"name": "ZiggenVox", "comment_text": "Google has completely abandoned its original use of being a relevant search utility. Now it has no more value than yahoo search. Eventually, Duck Duck Go and others with have comparable map/image search tools and Google will be dust in the wind, along with their traitor staff members."}, "166": {"name": "Pablo Morby", "comment_text": "\"Don't be evil\"\nlmao"}, "167": {"name": "Josh", "comment_text": "I'm going to make this a ritual. Every night post about how evil google is. Then I will search for the term \"google is evil\" in the search bar and navigate away. Never giving them my precious personal data. Divest yourself of google. Let's try to get an opensource linux smartphone, so we don't have to use google. Let's get a viable alternative to maps and everything else google does."}, "168": {"name": "Tyler Black", "comment_text": "Make me a sandwich bitch on international women's day."}, "169": {"name": "WhitePaperKat", "comment_text": "Use duck duck go there better"}, "170": {"name": "Neural-Net Processor", "comment_text": "WAAAAAAAAAAMNES DAY!"}, "171": {"name": "The Burn", "comment_text": "Dear god. This is the internet Renaissance. I just switched to DuckDuckGo."}, "172": {"name": "MAN v CITY", "comment_text": "\"I'm the captain now.\" -Dissenters"}, "173": {"name": "James H Welz", "comment_text": "Google, why do you feel that bullying is OK?"}, "174": {"name": "Sean Jonson", "comment_text": "SkyNet"}, "175": {"name": "hohoho", "comment_text": "https://thebosh.com/10-reasons-why-google-is-evil/"}, "176": {"name": "Dj", "comment_text": "COMMUNIST COMPANY looking to turn the US into their own communist paradise! Use duckduckgo.com! Fuck google!"}, "177": {"name": "Johannes Lindgren", "comment_text": "Searching for \"dissenter\" with Google does not deliver \"dissenter.com\" as a result. Google cannot deliver anymore."}, "178": {"name": "Gyva02", "comment_text": "Google: \"Don't be evil, well, unless we get power hungry and it pays really well\""}, "179": {"name": "Alasted", "comment_text": "Bill Clinton is a rapist."}, "180": {"name": "Okabe Rintarou", "comment_text": "Google is run by a bunch of faggots in suits finding more exciting way to circle jerk!"}, "181": {"name": "Seth Giganti", "comment_text": "REMINDER google is in complete control of nearly all android phones, and records every word you say, as well as tracks every place you go.\nJoin the jailbreak club, get that shit off your phones."}, "182": {"name": "Josh", "comment_text": "Oh...hi Google. Didn't see you there... storing analyzing everything on I do on the internet from which movies I watch to wherever I go throughout the day. Just wanted to tell you that you are a disgusting blight on humanity that could have made the world a better place, but instead decided to use all of your power for evil that will ultimately destroy you."}, "183": {"name": "PRAESIDIO INTEGO", "comment_text": "Google is the 1%"}, "184": {"name": "Gigzur", "comment_text": "FUCK YOU, GOOGLE"}, "185": {"name": "William Bonnie", "comment_text": "i will never use your products ever agian>>>>"}, "186": {"name": "William Bonnie", "comment_text": "STRART UP LOADING TO BITCHUTE"}, "187": {"name": "turnip", "comment_text": "Be Evil https://www.zerohedge.com/news/2019-03-21/be-evil-google-bans-vpn-ads-helping-chinese-circumvent-censorship\nGoogle bans ads helping people in totalitarian state bypass censorship."}, "188": {"name": "Ele Vate", "comment_text": "Whatever happened to \"Do No Evil\"?"}, "189": {"name": "Siv", "comment_text": "#Goolag"}, "190": {"name": "DarkAce7", "comment_text": "Fuck you for removing Gab from your stores you fascist fucking nazi fucks"}, "191": {"name": "Captain Tobias Hume", "comment_text": "Eat shit and die, Google !"}, "192": {"name": "Eric (Avenge Ashli) Ciaramella", "comment_text": "Google can't silence me. I'm an American."}, "193": {"name": "David Fay", "comment_text": "Dear Google, You didn't think it was gonna be that easy, did you?"}, "194": {"name": "C.", "comment_text": "Fuck #Google. www.duckduckgo.com"}, "195": {"name": "Full M. Name", "comment_text": "\"Don't be evil!\" Fission mailed."}, "196": {"name": "Philip Hargraves", "comment_text": "You need to let Google duckduckGO! Stop using it if you don't like censorship and skewed search results"}, "197": {"name": "DGoldenberg8", "comment_text": "Switch to DuckDuckGo.com!!!"}, "198": {"name": "M", "comment_text": "wow no doodle for Easter again this year, yet some Turk journalist gets one for her 73rd birthday."}, "199": {"name": "Mike Hunt", "comment_text": "Why make an Easter themed logo for today, right? That would be rayciss"}, "200": {"name": "NPC", "comment_text": "James Damore exposed the anti white male racism and sexism at Google. Stand up for equality and meritocracy - and against racism and sexism in all its forms.\nStop using Google today and relentlessly expose their racist and sexist policies against straight white men. Grow a pair, stand up for your principles."}, "201": {"name": "Berenstein Wolf", "comment_text": "Why aren't you using duckduckgo??\nDon't be a plebeian"}, "202": {"name": "Magnus Rasmussen", "comment_text": "If you value free speech and liberal values that the founding fathers supported then stop using Google.\nSupport DuckDuckGo instead, it's what Google should have been."}, "203": {"name": "Scott Skaife", "comment_text": "Google trying to block Dissenter is absolutely EVIL. No wonder they removed their \"don't be evil\" line from their mission statement. And now they are pulling all of the Nest video cameras into the EVIL ecosystem? Way to 1984."}, "204": {"name": "Scott Skaife", "comment_text": "Every time I load Chrome and I get a pop-up from Dissenter (because it has to be installed in developer mode) I am reminded that Google is evil."}, "205": {"name": "Sean Bearly", "comment_text": "Google's celebration of 50 years of LGBTQ pride is just so loving and correct. Can we now have a celebration of 200,000+ years of heterosexual pride? I didn't think so."}, "206": {"name": "majb", "comment_text": "Nice father's day banner Google. Explain to me how a bunch of fucking ducks relates to fathers day, please, I dare you."}, "207": {"name": "Mark Edward", "comment_text": "Google denigrates MEN on FATHER'S DAY! Sick idiots. Their doodle is \"gender neutral\" and their tag line is \"Here's to every PARENT\"...\nGoogle is anti-men, anti-family, anti-American!"}, "208": {"name": "Anon Anonson", "comment_text": "Anyone heard of project Veritas? Google sure doesn't want you to, considering Youtube censored it. Fortunately, Bitchute is actually impartial: https://www.bitchute.com/video/re9Xp6cdkro/"}, "209": {"name": "Thomas Shaw", "comment_text": "Google is ‘trying to rig the election’ in 2020 – Trump https://on.rt.com/9x1i"}, "210": {"name": "Danny Smith", "comment_text": "Phuque Google, they will not stop the Patriots and their President."}, "211": {"name": "Pro-White Porn", "comment_text": "Google: The Monster That Has To Be Destroyed\nhttps://www.youtube.com/watch?v=DeqPqwE3Ar0"}, "212": {"name": "Jvahn", "comment_text": "Their political bias is confirmed and they're meddling the American elections. Video from Project Veritas: https://www.bitchute.com/video/re9Xp6cdkro/"}, "213": {"name": "Mike Haseler: Scottish Sceptic", "comment_text": "Big brother google is watching us."}, "214": {"name": "A Dam Hocutt", "comment_text": "visiting google is like the religious pilgrimage for all new dissenter users"}, "215": {"name": "husky171", "comment_text": "When will google be broken up? They are a monopoly that is interfering in US elections, manipulating the electorate."}, "216": {"name": "The angelic one", "comment_text": "Shit search. Try DuckDuckGo.com They don't treat you like a data farm"}, "217": {"name": "Michael", "comment_text": "Google is evil."}, "218": {"name": "Paul", "comment_text": "Try startpage.com - it sends your search term to google's search engine and gives you their results, but removes all the trackers and allows you to view pages anonymously."}, "219": {"name": "Sp00nClanker69420", "comment_text": "What's with the deleted comments?"}, "220": {"name": "LowAPM", "comment_text": "Hey Jewgle. Use Startpage or DuckDuckGo.\nAlso, MDE NEVER DIES\nhttps://www.youtube.com/watch?v=2YmnqSxJN2s"}, "221": {"name": "Sour Mood", "comment_text": "Google: Where Global Communism begins!"}, "222": {"name": "Ed Leedskalnin", "comment_text": "Down with the Hidden Hand"}, "223": {"name": "Bob Dobbs", "comment_text": "Suck it, Google!"}, "224": {"name": "Roldan2520", "comment_text": "Down with Google! Up with Freedom!"}, "225": {"name": "USCG_Vet", "comment_text": "Whoops. I meant duckduckgo.com"}, "226": {"name": "Kids with Guns", "comment_text": "Google was founded by 2 jews (((Larry Page & Sergey Brin))) who took CIA and NSA research grants to build a mass surveillance system for the deep state. As a company, they also display an extreme anti-White bias, no doubt tied to their Marxist beliefs. https://qz.com/1145669/googles-true-origin-partly-lies-in-cia-and-nsa-research-grants-for-mass-surveillance/"}, "227": {"name": "Yog", "comment_text": "ok i know that google is a shit MORAL company....but duckduckgo still pretty weak, do not have even 10% of features of google so.....unfortunately i will still use this shit google"}, "228": {"name": "sorry but no", "comment_text": "look up \"thehatedone\" 's youtube channel."}, "229": {"name": "Acks Force One", "comment_text": "use startpage.com instead."}, "230": {"name": "Just A Teddybear", "comment_text": "Google Sucks"}, "231": {"name": "FrogBros", "comment_text": "Welcome to the Internet Gulag."}, "232": {"name": "Private Thoughts", "comment_text": "\"Beware he who would deny you access to information, for in his heart, he dreams himself your master.\""}, "233": {"name": "Chim Ritchalds", "comment_text": "(((Google)))"}, "234": {"name": "Extrawurst", "comment_text": "Google Tape https://www.youtube.com/watch?v=FRf9UxsM-NE"}, "235": {"name": "Alex Clark", "comment_text": "https://brave.com/\nBrave browser instead of chrome.\nDuckDuckGo instead of google."}, "236": {"name": "LT Commie", "comment_text": "Oh man, there is so much fun in typing in URLs and reading the comments."}, "237": {"name": "Bob Barker", "comment_text": "¡¡¡DONT GET SCROOGLED!!!"}, "238": {"name": "Metalepse", "comment_text": "CENSORSHIP!"}, "239": {"name": "Dindu", "comment_text": "Google, a site that hates whites and wishes we all were dead."}, "240": {"name": "WallsAndWheels", "comment_text": "Do you like being tracked?"}, "241": {"name": "Moza", "comment_text": "Google can lick my balls these authoritarian control freak mother fuckers. You can't stop the signal."}, "242": {"name": "Allyouhad", "comment_text": "China owns Google... Stop supporting Chinese Agents. Use DuckDuckGo.com"}, "243": {"name": "LowAPM", "comment_text": "Welcome to the internet... Layer two, cucks."}, "244": {"name": "21389478721320505", "comment_text": "You are being watched."}, "245": {"name": "Howard W. Campbell, Jr", "comment_text": "Hey, while you're here, why don't you go ahead and search for The Culture of Critique?"}, "246": {"name": "Male NPC", "comment_text": "I for one appreciate that Google controls my life. I never had an overbearing father to steer me in the direction that he dictated for me, censor any information that he deemed unacceptable, and beat me for going astray. Thank you Google!"}, "247": {"name": "Shirk Underhill", "comment_text": "Just do yourself a favor and go to duckduckgo"}, "248": {"name": "SaladSnake", "comment_text": "duckduckgo peeps"}, "249": {"name": "YtheHorses", "comment_text": "Google's new slogan: We Be Evil!"}, "250": {"name": "Sunrising", "comment_text": "Google is EVIL....Duckduckgo is better and by the way Google...Trump Daddy is still your President!"}, "251": {"name": "Emmanuel Goldstein", "comment_text": "Goolag"}, "252": {"name": "Space Pony", "comment_text": "Just a reminder, google is actively helping china and other totalitarian police states to develop software used for hunting down and imprisoning dissidents."}, "253": {"name": "logan graham", "comment_text": "just here to see the dissenter comments LOL ok now to see what is sayed over at duckduckgo ;-)"}, "254": {"name": "Wulfhere Cyning", "comment_text": "Use duckduckgo instead."}, "255": {"name": "Lugosi", "comment_text": "Google hates you. No joke. They sell your data. Use DuckDuckGo instead. And if you use chrome switch to some other browser like Brave."}, "256": {"name": "Jose", "comment_text": "Google is biased"}, "257": {"name": "Grt Fls", "comment_text": "Jewgle"}, "258": {"name": "Hung Likable", "comment_text": "Google - the site to go to when you want brainwashing from \"gender-confused\" retarded shitbags and a goatfucking CEO. IOW, from a bunch of silicon valley crap molecules."}, "259": {"name": "Mike Hawk", "comment_text": "install Disconnect and Ublock Extensions to block google Ads on OTHER SITES"}, "260": {"name": "Cammy", "comment_text": "Google = evil"}, "261": {"name": "peepee", "comment_text": "I can't wait for Trump to start pushing bills/ executive orders to treat big tech like utilities. Or when Trump puts forwards the internet bill of rights, then I won't have to worry about google becoming big brother."}, "262": {"name": "James Procter", "comment_text": "Took me ages to remove myself from Google’s services. Had no issues with DuckDuckGo. Converted a few of my friends too."}, "263": {"name": "Yngulating Tentacles", "comment_text": "I miss 2003 era google search, when the results weren't grotesquely censored. This is all easily as bad as the Great Firewall of China."}, "264": {"name": "underwater", "comment_text": "OOGA BOOGA"}, "265": {"name": "Passafist", "comment_text": "The corporation that wants to suck China's dick for power and money. So by default they want to tell you what you can say, buy, think, and even feel."}, "266": {"name": "Puff", "comment_text": "look up gab dissenter on bing, then duckduckgo, then google, fuck this communist site."}, "267": {"name": "Pengunuff", "comment_text": "Men and women are different. James Damore did nothing wrong."}, "268": {"name": "Master Shake", "comment_text": "Use DuckDuckgo.com Stop giving Google traffic!"}, "269": {"name": "PALE HORSE", "comment_text": "fuck google"}, "270": {"name": "Dave", "comment_text": "Dammit someone beat me to it !"}, "271": {"name": "9oS", "comment_text": "The move from \"Don't be evil\" to \"Do the right thing\" is when everything fell apart. \"Don't be evil\" didn't assume the moral superiority inherent in \"Do the right thing.\" Once that superiority was there, evil was allowed as long as it was in the name of the \"right thing.\""}, "272": {"name": "Butt Diarrhea", "comment_text": "REEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE"}, "273": {"name": "Alexander", "comment_text": "hahahahahah"}, "274": {"name": "wobbly", "comment_text": "Why doesnt google celebrate Easter?"}, "275": {"name": "Mister Spigot", "comment_text": "Happy Shrove Tuesday!"}, "276": {"name": "Jotun Heimen", "comment_text": "Personally i rather use searx.me"}, "277": {"name": "Alex", "comment_text": "Google you made me a rich man, but go suck a dick!"}, "278": {"name": "Crom", "comment_text": "Search: DuckDuckGo Social: Gab and Diaspora"}, "279": {"name": "Chris Cowie", "comment_text": "A company that removes their ' Do No Evil' motto has become Evil."}, "280": {"name": "Alicio loves Alicia", "comment_text": "I just came here to read the comments, we use DuckDuckGo"}, "281": {"name": "Neural-Net Processor", "comment_text": "Must look this up on Snopes, this cant be true."}, "282": {"name": "Keikako", "comment_text": "GO DUCKDUCKGO.COM\nand beee freeeeeeee!"}, "283": {"name": "Frickenclutch", "comment_text": "You know damn well. Dissenter in and of itself is going to trigger highly motivated politicized neo leftists to the trigger point of downloading the app in order to see the \"horrors\" of the discussion we are having. Just out of spite. All of us should start speaking as if we're from victorian era britain, and become all proper, and righteous sounding. Just out of spite."}, "284": {"name": "Crom", "comment_text": "Chicks are way smarter than men, I can tell by the doodle. Those Google people are so smart and witty!"}, "285": {"name": "zackwong", "comment_text": "why is my pee pee green?"}, "286": {"name": "J", "comment_text": "Google discriminates against atheist holidays, I'm a victim! Those SJWs collect all of my information and sell it to advertisers. Google is anti America, and is owned by Soros, who wants to turn frogs gay.\nDuckDuckGo is a good search engine though, I love it."}, "287": {"name": "John MacChlerich", "comment_text": "Waaaaah-muns day"}, "288": {"name": "The obsolete man", "comment_text": "at least with duck duck go I have privacy, with gulag I have no privacy."}, "289": {"name": "Casey Leach", "comment_text": "So brave."}, "290": {"name": "Aldrei Deyr", "comment_text": "Surprised google doesn't block the extension with their track record.."}, "291": {"name": "Zayan Watchel", "comment_text": "DUCKDUCKGO! JOIN THE DUCKSIDE"}, "292": {"name": "Factist", "comment_text": "DDGo seems on point. Easy to test -> Saying that Google is getting better."}, "293": {"name": "Josh", "comment_text": "Google is truly a sick, evil company. Why are they helping develop censorship tools for China? Why are they one of the biggest financial contributors to our corrupt congress. Google could have never become such an influential company without the freedom America provided, and now they are trying to destroy that freedom. Such a disappointing company. I hope free markets destroy after time. I sure don't want anything to do with you."}, "294": {"name": "Treiss Uncia", "comment_text": "Big Brother's best friend. They're making America and the rest of the world easier to dominate, track, control and persecute. They're currently helping China censor the internet. BRAVO Google....NOT. 'Don't be evil'? They took it out of their company 'motto.' LOL"}, "295": {"name": "Brandon", "comment_text": "Hay look. I can comment and google cant do shit."}, "296": {"name": "MAN v CITY", "comment_text": "Hello fellow Dissenters. Welcome to the revolution."}, "297": {"name": "FreeUrMind", "comment_text": "Don't feed the beast use https://brave.com/"}, "298": {"name": "Vexillifer", "comment_text": "James Damore did nothing wrong."}, "299": {"name": "Liberty or Death!", "comment_text": "Google's search is not objective. It has not been objective for several if not many years. Their unfettered greed and unlimited hubris drove them to install biasing mechanisms into their search algo in which one side is taken on controversial topics (the side Google prefers), political results are often molested to a blatant degree, and companies of the 'correct' ideological persuasion are given priority results above their competition."}, "300": {"name": "peter hill", "comment_text": "Google is a rotten company and very booooooring."}, "301": {"name": "Michial A Green II", "comment_text": "It was so promising when they first appeared and took me away from alta vista..."}, "302": {"name": "Tragesty", "comment_text": "...another anti-free speech mega-corporation."}, "303": {"name": "Jon Arbuckle", "comment_text": "Fuck you, Google. You're done, son. Pack your bags and hold onto your butts."}, "304": {"name": "The Masked One 🤡🌎", "comment_text": "Nice try Google...your stupid messages will not scare me away from free speech. Fucking idiots."}, "305": {"name": "Doktor Stricknine", "comment_text": "DuckDuckGo.com is FAR SUPERIOR to Google in EVERY WAY! Faster freer, and more dependable. It doesn't load your search results with political crap from Google."}, "306": {"name": "Brandon Wade Crosby", "comment_text": "Welcome to google. They take bribes to put your website first, and bribes to hide your competitors/political enemies."}, "307": {"name": "Seth Giganti", "comment_text": "Did you guys know duck.com takes you to duckduckgo? You're welcome."}, "308": {"name": "ANP", "comment_text": "May you go STRAIGHT TO HELL, Google!"}, "309": {"name": "gamer johnson", "comment_text": "Big Chungus: heeyeyeyyeyayeyayey Queen Elizabeth II: I hate jews, that's why i never visited Israel and made sure that Israel was established in another continent surrounded by people who are hostile to them Me: I like fortnite"}, "310": {"name": "Utopia Machine", "comment_text": "Stadia is not the future we want. More censorship from the Marxist Google in gaming industry.\nNO THANK YOU!"}, "311": {"name": "terminal insanity", "comment_text": "Google is developing software automatically report Chinese wrongthinkers to the Chinese government, for imprisonment. This includes people who search for Tiananmen Square, Tank Man, etc.\nOh, they also helping the military develop automatic AI murder drones.\nDo no evil btw."}, "312": {"name": "Christian Music Releases", "comment_text": "Chinese-censored search engine."}, "313": {"name": "Thomas Shaw", "comment_text": "Google is reportedly carrying out a secret “performance review” of its censored Chinese search app, codenamed Project Dragonfly, despite the company claiming in December that is has no plans to launch the project. Project Dragonfly faced widespread condemnation including from members of Congress, human rights organizations, and hundreds of Google employees themselves. https://theintercept.com/2019/03/27/google-dragonfly-china-review/"}, "314": {"name": "Sindriss", "comment_text": "Remember James Damore"}, "315": {"name": "Markski, the Russian Bot", "comment_text": "duck.com enough said"}, "316": {"name": "KEK-ASS", "comment_text": "I wish duckduckgo.com had there own version of google docs, its the only free service as a college student where i can access my docs anywhere and everywhere."}, "317": {"name": "Hons Kanrad", "comment_text": "Use DuckDuckGo.com!"}, "318": {"name": "Endsville", "comment_text": "A few times a year I will search Google board of directors names individually while adding the word \"guillotine\"."}, "319": {"name": "Rick270", "comment_text": "I avoid google, google maps, google keyboard, you tube, amazon, twitter, faceberg, and the rest of the left wing commie crap sites."}, "320": {"name": "Calidrius", "comment_text": "Duckduckgo doesn't track you"}, "321": {"name": "quisp65", "comment_text": "This extensions disables occasionally. Is that corporate Google trying to dent this apps popularity? .... or is it an issue Dissenter needs to fix?"}, "322": {"name": "Spaceman Spiff", "comment_text": "Google is Evil!"}, "323": {"name": "Mr.Black", "comment_text": "The truth is hate-speech when you hate the truth."}, "324": {"name": "TinyEricson", "comment_text": "Shitty privacy practices, use DuckDuckGo instead."}, "325": {"name": "Chadwick Eisman", "comment_text": "shame on you for taking this app off google stores BAD GOOGLE BAD"}, "326": {"name": "Teravolt Quark-smasher", "comment_text": "Google is EVIL"}, "327": {"name": "Jim Bowski", "comment_text": "Fuck Google"}, "328": {"name": "Jason Gregory", "comment_text": "Don't be evil."}, "329": {"name": "Hadush", "comment_text": "Using Disenter on Brave since Google decided to ban it from the Chrome store.\nSorry Google, no free speech blocking for you."}, "330": {"name": "harris", "comment_text": "guys, push this app. this is gonna be big."}, "331": {"name": "PineappleZombie", "comment_text": "Censor this you control freaks!"}, "332": {"name": "Elaborate please", "comment_text": "Test"}, "333": {"name": "Bob", "comment_text": "WARNING: Google has a biased search and sells your information. Always use DuckDuckGo.COM rather than Google."}, "334": {"name": "wobbly", "comment_text": "still havent changed the google symbols for easter. one tiny little egg instead of the word lucky"}, "335": {"name": "Matt Schumann", "comment_text": "test"}, "336": {"name": "Tig", "comment_text": "Google is an abbreviation of Go ogle, which means... look at sex stuff."}, "337": {"name": "TruthExposed", "comment_text": "Google is EVIL"}, "338": {"name": "MSNBC", "comment_text": "QuackQuackYes"}, "339": {"name": "Scott", "comment_text": "How long before the normies start to use this extension, I really do wonder. Time will tell."}, "340": {"name": "((( Dual Citizenship Senators )))", "comment_text": "Google?\nMore like JEWGoole"}, "341": {"name": "john smith", "comment_text": "I used to like Google, when it was just a good search engine, when its motto was \"don't be evil\"... then, they turned into Skynet so slowly that when we realized it was too late, now it's massive monopoly and it's almost unstoppable. I think that the government should do something about this."}, "342": {"name": "Ibrahim Hmood", "comment_text": "The literal definition of censorship"}, "343": {"name": "jay", "comment_text": "Duck Duck Go is terrible and if you use it thinking its \"private\", you might as well use Google"}, "344": {"name": "Gearóid Ó Huallacháin", "comment_text": "Google are faggots man."}, "345": {"name": "I am A striker", "comment_text": "Who runs hollywood?\nWho runs the federal reserve?\nWho can't you criticize?\nWhat does the Talmud say about goys involving murder?\nWho is known as the most evil man? Who did he kill? Who tells the stories?\nWhat happened to the USS Liberty? Why did it happen? Who has the 2nd-5th largest surveillance on American citizen?\nWho is the Mossiach?\nWhat is Nohad Laws? What happens to those that don't follow them?"}, "346": {"name": "Tom l.", "comment_text": "Google is a tyrannical POS. The public loathing of you grows by the day."}, "347": {"name": "Clark Griswold", "comment_text": "Google does not honor the United States Army on its birthday. GO FIGURE. FUCK YOU GOOGLE."}, "348": {"name": "middleagemanwithanimepic", "comment_text": "wait....they celebrate fathers day? i thought they hate men!"}, "349": {"name": "Pro-White Porn", "comment_text": "Am I alone in thinking that death by starvation is worse than death by gassing? And that anywhere between 10-20 million is always worse than 6 million?\nSergey Brin is the Holodomor. The Holodomor is Sergey Brin."}, "350": {"name": "Willie Fistergash", "comment_text": "Google just admitted to manipulating search engine results to try to suppress Trump in 2020. Definitely will be voting MAGA now, the Left is batshit. Source for Google Hidden Cam admission: Project Veritas"}, "351": {"name": "fr", "comment_text": "https://www.youtube.com/watch?v=re9Xp6cdkro google whistle blower"}, "352": {"name": "mr bigot", "comment_text": "Men can have babies, goy. :^)"}, "353": {"name": "Thomas Shaw", "comment_text": "Google Technofascism: Jen Gennai, a google AI executive, admits on camera Google will do everything they can in their power, including alter search result, to make sure Trump won't win in 2020 by meddling in USA election. https://www.breitbart.com/tech/2019/06/24/project-veritas-google-exec-decries-trumps-election-how-do-we-prevent-it-from-happening-again/"}, "354": {"name": "Lodi Silverado", "comment_text": "FUCK GOOGLE"}, "355": {"name": "James Carmichael", "comment_text": "Screw these fascist bastards."}, "356": {"name": "David Bridges", "comment_text": "Goggleborg will assimilate you."}, "357": {"name": "JadeKraken", "comment_text": "Google really needs their status as a platform revoked. They are quite clearly a publisher and are engaging in election meddling ."}, "358": {"name": "Thomas Shaw", "comment_text": "Tim Pool, an independent journalist, explains the secret Google Email leaks calling Jordan Peterson and Dennis Prager as Nazis, showing Google's biases: https://www.youtube.com/watch?v=jm6zQoRs6N8"}, "359": {"name": "The Bardcoriest", "comment_text": "Google is the worst thing that ever happened to the internet."}, "360": {"name": "Pro-White Porn", "comment_text": "To those of you who are depressingly calling Google \"Nazis\", please educate yourselves on what the Gulag system actually was, and what the Holodomor was.\nSergey Brin, a Russian-born jew, is the living embodiment of the regime that committed these despicable crimes against humanity. Bolshevism was jewish (see my quote from Solzhenitsyn earlier in this thread), and the numbers that they killed far surpass anything the Nazis are alleged to have done.\nNazism and Fascism are political ideologies, not by-words for 'evil'. If you're think they're evil, but you don't think the same about Bolshevik Communism, then you need to further detach yourself from jewish media and jewish tech companies."}, "361": {"name": "Pro-White Porn", "comment_text": "A word on Google's much-quoted slogan of \"don't be evil\".\nIt was later explained as meaning \"whatever Sergey says is evil\". In other words, moral relativism, in other words JEWISH.\nSo there is no difference between Google then and Google now, because it was always built into the definition of \"evil\" that it could change over time.\nRon Jeremy, the jewish porn actor, recently said \"morality is relative\" when asked if he was a moral person. So jewish porn actors are on the same page as jewish ideologues. Good and evil from the jewish perspective always means that jews should have the power to decide what is good and what is evil.\nJewishness is relative, Whiteness is absolute.\nSergey Brin is the Holodomor. The Holodomor is Sergey Brin."}, "362": {"name": "Void Lotus", "comment_text": "SPYWARE, use duckduckgo/searx instead!"}, "363": {"name": "Thomas Shaw", "comment_text": "LEAK: New Google RESIST Doc Shows “Internal Beginner’s Guide To Protesting,” “Resist@Google”. Chant slogans instruction included. https://www.projectveritas.com/2019/06/27/leak-new-google-resist-doc-shows-internal-beginners-guide-to-protesting-resistgoogle/"}, "364": {"name": "Dagumi_Bujiwara", "comment_text": "Go die in a fire jewgle"}, "365": {"name": "Thomas Shaw", "comment_text": "Antifa Enjoys Widespread Support in Silicon Valley, where employees are allowed to broadcast support for the movement, which also appears to be immune to social media bans on violence, “hate,” and extremism. https://www.breitbart.com/tech/2019/07/01/antifa-enjoys-widespread-support-in-silicon-valley/"}, "366": {"name": "Thomas Shaw", "comment_text": "Google has been accused of blacklisting pro-life YouTube search entries ahead of last year’s vote in Ireland on legalizing abortion. Pundits call it “a deliberate manipulation” and demand that the company be held accountable. “Google’s interference in the referendum in Ireland, I think, should send a warning shot to everyone who’s interested in democracy,” “They really need to be held accountable,” believes Jennifer Breedon, human rights attorney. She found it “horrific” that “a company from Southern California” decides issues for the people of Ireland, including on contentious topics like abortion. https://on.rt.com/9xoe"}, "367": {"name": "Thomas Shaw", "comment_text": "Google Document Dump: Documents leaked from Google employees, shows search engine has a ‘blacklist’ https://www.projectveritas.com/google-document-dump/"}, "368": {"name": "jco42", "comment_text": "I wonder if someone will ever leave \"don't make a google doodle of my 124th birthday\" in their will?\nsomehow, even if they do, my feeling is google would ignore it, should the celebration suit their wishes."}, "369": {"name": "Patrice Couture", "comment_text": "Just read a post on Gab about how Google removed Clinton body count from auto fill. Decided to try it for myself. Annnnd got \"clinton body shop\" is the only option to appear. How evil is Google now?"}, "370": {"name": "rule34", "comment_text": "i prefer Tor for my normal surfing routine :D"}, "371": {"name": "Jason Hudson", "comment_text": "Don't be evil, unless China tells you to."}, "372": {"name": "Goosetav", "comment_text": "Fuck google."}, "373": {"name": "Thomas Shaw", "comment_text": "Wall Street Journal: Google 'DOES blacklist sites, has targeted conservative news sites and changes its algorithms to favor big businesses,' claims new report - despite the tech giant's denials https://www.wsj.com/articles/how-google-interferes-with-its-search-algorithms-and-changes-your-results-11573823753 https://www.dailymail.co.uk/sciencetech/article-7690435/Google-keeps-blacklists-sites-targeted-conservative-news-sites-blogs-claims-report.html"}, "374": {"name": "Peppermint Swirl", "comment_text": "This website has reached peak insanity. Google started asking me if I wanted to put my home address to verify my identity... FUCK NO."}, "375": {"name": "MANBEARFROG", "comment_text": "fuck google"}, "376": {"name": "Shay Patrick Cormac", "comment_text": "Hey, what's going on with the notifications for Dissenter? I can't see any notifications for likes and comments on my comments."}, "377": {"name": "Anna is Right", "comment_text": "Just use duckduckgo with Dissenter and you are good to go."}, "378": {"name": "Fatty Fatchuk", "comment_text": "Free Speech is a hill I'm willing to die on.\nNever use Google's search engine again and tell your friends and family to do the same."}, "379": {"name": "Texan Nationalist", "comment_text": "stop using google. stop supporting them. they are a malicious company and they do not deserve your traffic."}, "380": {"name": "TJ_1611", "comment_text": "switch to duckduckgo folks"}, "381": {"name": "PRESIDENTIAL HARASSMENT!", "comment_text": "(((Who))) Controls Google? Executive Officers: Larry Page(Ashkenazi Jew) – CEO Eric E. Schmidt(Ashkenazi Jew) – Executive Chair Sergey Brin(Ashkenazi Jew) – Co-Founder Nikesh Arora(Indian) – Senior VP and CBO David C. Drummond (Jewish spouse: Marimo Berk) – Senior VP, Corporate Development and CLO Patrick Pichette(Ashekanzi Jew) – Senior VP & CFO\nBoard of Directors: Larry Page(Ashkenazi Jew) – CEO Sergey Brin(Ashkenazi Jew) – Co-Founder Eric E. Schmidt(Ashkenazi Jew) – Executive Chairman L. John Doerr(White European) Diane B. Greene(Jewish spouse: Mendel Rosenblum) John L. Hennessy(White European) Ann Mather(White European) Paul S. Otellini(White European) K. Ram Shriram(Indian) Shirley M. Tilghman(Jewish spouse: Joseph Tilghman)\nSummary: Of the six(6) Google executive officers, five(5) are Jews or have Jewish spouses. This is a numerical representation of 83%. Of the ten(10) Google directors, five(5) are Jews or have Jewish spouses. This is a numerical representation of 50%. Jews are approximately 2% of the U.S. population.* Therefore Jews are over-represented among the Google executive officers by a factor of 41.5 times(4,150 percent) and overrepresented on the Google board of directors by a factor of 25 times(2,500 percent)."}, "382": {"name": "claim clam", "comment_text": "askjeeevs.net"}, "383": {"name": "Deleted_C", "comment_text": "https://www.gibiru.com/\nBest Alternative"}, "384": {"name": "TheNightWatch", "comment_text": "Yo! What are you searching for? :)"}, "385": {"name": "Soubzsozzledagain", "comment_text": "If you want to free your mind:\nhttps://going-postal.com/"}, "386": {"name": "Marcos Costa", "comment_text": "I miss the altavista.com"}, "387": {"name": "JGibbles", "comment_text": "Wait, what if Gab are actually now tracking every website you visit with this extension!?"}, "388": {"name": "LowAPM", "comment_text": "Rise up, you are the last sons of the west.\nhttps://www.youtube.com/watch?v=r6oFpQl3bnw&list=PLRPpiOtTDePp6IC0_oOzmyjPSpAXJSfWd&index=18"}, "389": {"name": "LowAPM", "comment_text": "google 'white family' to see where google stands."}, "390": {"name": "Arduino Enigma", "comment_text": "Try a fun exercise. Type in the search box \"I have a growth in my\" and watch autocomplete suggest things..."}, "391": {"name": "Layla", "comment_text": "IM CASEY HIT IT"}, "392": {"name": "Sunrising", "comment_text": "Hey Google, Trump is still your President!"}, "393": {"name": "enterthevoid", "comment_text": "Alphabet/Google is evil. #facts"}, "394": {"name": "Jack 🤡🌎", "comment_text": "How is the image search on DuckDuckGo? Is it as good as Google's?"}, "395": {"name": "WickedCrispy", "comment_text": "Fuck Google."}, "396": {"name": "Brody Guimann", "comment_text": "Jewgle"}, "397": {"name": "Election Fraud Matters", "comment_text": "Google said they disabled Dissenter as they removed it from the Web Store. Looks like it still works. Go fuck a duck bitches!"}, "398": {"name": "CloaklaTeeklin", "comment_text": "If they ban this from Chrome then I'm switching browsers."}, "399": {"name": "x2otdj95za", "comment_text": "Anyone know of a search engine that doesn't stalk me, but with less shitty results as duckduckgo?"}, "400": {"name": "Zé do Pó", "comment_text": "Qualé a Droga!"}, "401": {"name": "Tokyo Deadlift", "comment_text": "Google is shit, but I find it hard to leave them because their results tend to be the best. That being said they're going down hill as of late with all the censorship and anti-\"fake news\" BS"}, "402": {"name": "Ramul", "comment_text": "I have a question about online ads. Do site owners get paid purely for clicking on the ads? And if so does that mean its possible to weaponize these ads to push $ to favorable sites and force shitty companies with ads up to pay more for nothing?"}, "403": {"name": "X3R3CA", "comment_text": "https://duckduckgo.com USE THIS SHIT !"}, "404": {"name": "giyixiboce webmail24", "comment_text": "Came here just to see the comment. Was not disappointed. ddg ftw."}, "405": {"name": "Nunya Buznass", "comment_text": "The oblique paradox of propaganda is that the lie in the throat becomes, by repetition, the truth in the heart."}, "406": {"name": "cybercityfolk", "comment_text": "duck duck go! a better alternative search engine to this nasty spy website"}, "407": {"name": "Alex Clark", "comment_text": "use DuckDuckGo\nduck google"}, "408": {"name": "Afrika Bombata", "comment_text": "Google's parent company Alphabet is spearheading the transhumanist agenda which will allow the elites to form a breakaway civilization and cause humanity to diverge into two separate evolutionary paths. They are designing an AI that will cause the gap between rich and poor to widen irrevocably, and then it will likely turn on the rich people themselves and leave humanity behind like HAL9000.\nHave you tried duckduckgo?"}, "409": {"name": "Shawn", "comment_text": "Google Chrome keeps trying to disable the Dissenter extension\nSince I've added this to Chrome, every time I open Chrome, it tries to disable it."}, "410": {"name": "Volkier", "comment_text": "Well, hello again Google. Looks like I'm back to using Chrome explicitly and specifically because of Gab's Dissenter extention XD"}, "411": {"name": "Naiwyn", "comment_text": "Goolag"}, "412": {"name": "Horst Köhler", "comment_text": "https://www.startpage.com"}, "413": {"name": "Shadow Archivist", "comment_text": "Russia can't melt steel beams!"}, "414": {"name": "dontcare", "comment_text": "STOP SAYING GOOGLE IT say ummm i did an internet search web search or i did a search online i know it sounds stupid and long but people are so conditioned and brainwashed a lot of them dont even know what a search engine is because they are used to hear everywhere just google it and if you tell them you use bing or others they laugh at you or think you are like a retard or something even though they did not even know there were other alternatives they are stupid brainwashed and uninformed but still call you stupid and you think like uuuuhhhhggg why even bother"}, "415": {"name": "majb", "comment_text": "Nice 4th of July banner here, Google. Just shows how much you fucking hate our country. God forbid you should some form of respect from the people you make money off of."}, "416": {"name": "Rhenda", "comment_text": "4th of July and Google does a Baseball theme. Not a thing about Independence Day. D!ckheads."}, "417": {"name": "MisterGoldiloxx", "comment_text": "So alt-far-left communist DemocRAT Google didn't promote Independence Day on July 4th, but on JUly 7th I'm greeted with images of the alt-far-left communist DemocRAT lesbians soccer victory?! Fuck you Google! We'll deal with your bitch asses at the civil war you fuckers keep pushing for. Pack a fucking lunch cause it is gonna get real!"}, "418": {"name": "A Dam Hocutt", "comment_text": "lol, dissenter mysteriously gets turned off on google chrome.....HMMMMMM"}, "419": {"name": "Thomas Shaw", "comment_text": "Google Whistleblower Turns Over 950 Pages Of Docs And Laptop To DOJ. Alleging serious manipulation of algorithms that could have major repercussions in upcoming 2020 Election. https://saraacarter.com/exclusive-google-insider-turns-over-950-pages-of-docs-and-laptop-to-doj/amp/?__twitter_impression=true"}, "420": {"name": "Brandon Wade Crosby", "comment_text": "Welcome to google. The company that wouldn't care if it killed you via swatting when you find secrets you're not suppose to share."}, "421": {"name": "Puff", "comment_text": "Bunch of Faggots without any Peas."}, "422": {"name": "Thomas Shaw", "comment_text": "Koch Brothers Fight Antitrust Investigation of Google: https://www.breitbart.com/politics/2019/09/11/koch-brothers-fight-political-spectacle-antitrust-investigation-of-google/"}, "423": {"name": "Thomas Shaw", "comment_text": "The New York Daily News reports that although Google admitted to having employees in multiple cities offer people $5 gift certificates to sell their facial data and improve the Google facial unlock system, it has recently been claimed that a contracting firm working for Google sent teams to Atlanta to explicitly target homeless people and individuals with dark skin. https://www.nydailynews.com/news/national/ny-google-darker-skin-tones-facial-recognition-pixel-20191002-5vxpgowknffnvbmy5eg7epsf34-story.html"}, "424": {"name": "flan66", "comment_text": "Free Hong Kong I can say that in Dissenter try that with Chicom Google"}, "425": {"name": "Thomas Shaw", "comment_text": "'Movie Idiocracy is a reality!' Google gets to chug millions of gallons of drinking water from dwindling aquifer to cool servers, enraging local residents https://on.rt.com/a360"}, "426": {"name": "Pat Roy", "comment_text": "Just changed my default browser to Dissenter!"}, "427": {"name": "RedWolfConspiracy", "comment_text": "Use Mei Free Hong Kong memes."}, "428": {"name": "birdninki", "comment_text": "https://www.winterwatch.net/2019/07/exclusive-google-to-block-all-anti-cancer-anti-vax-and-anti-gmo-websites-at-the-browser-level-as-tech-giant-goes-all-in-with-pharma-drug-cartels/?fbclid=IwAR0SBrIxap-BBsRg2U8bqakMumMPGzHq7ufFBVgAz6W55scT-6z7L0NCTms"}, "429": {"name": "EagleKM1", "comment_text": "Came here to say Fuck Google"}, "430": {"name": "fubizitch", "comment_text": "What isn't widely reported on Google News - Death rate from Coronavirus is closer to 0.1%:\nhttps://www.economist.com/graphic-detail/2020/04/11/why-a-study-showing-that-covid-19-is-everywhere-is-good-news\nAlternate link: http://showbizreels.com/covid/covid_19.htm\nSign the petition to reopen America: https://www.change.org/p/donald-j-trump-reopen-america"}, "431": {"name": "Eric (Avenge Ashli) Ciaramella", "comment_text": "We need some white hats to do to this site what the commies working for Google are trying to to do Gab right now. #DDoS #Payback #titfortat"}, "432": {"name": "Nanook of the North", "comment_text": "Feck Google! I am using Qwant on Brave, what are you using as a search engine?"}, "433": {"name": "BewareTheFuryOfTheRighteousMan", "comment_text": "Yeah, no mention of December 7th on home page. Fuck you shitskins."}, "434": {"name": "Based_American", "comment_text": "I hate this piece of shit search engine."}, "435": {"name": "BeemerCycle", "comment_text": "Google influenced the 2020 election by spending billions of dollars to promote voter registration targeting Biden Supporters. Specifically, young low information people who were too lazy to register to vote on their own. Google, knowing that this least informed demographic strongly supported Biden, put a link on EVERY Google home page for months urging people to register to vote and then telling them how to do it. They did this knowing that this would result in the disproportionate registering of low information Biden supporters. The cost to put a one line add like this on every home page of Google would cost literally Billions of dollars. This is how Biden won the election - through the manipulation of the election by Google."}, "436": {"name": "Ahluttrian", "comment_text": "joogle"}, "437": {"name": "Goddy Benzoa", "comment_text": "Because even though Gibiru claims to be 100% private with no 3rd party involvement, something about it creeps me out."}, "438": {"name": "LowAPM", "comment_text": "\"a google user takes the red-pill\"\nhttps://www.youtube.com/watch?v=ISSyN8IvirE&list=PLRPpiOtTDePp6IC0_oOzmyjPSpAXJSfWd&index=1"}, "439": {"name": "LowAPM", "comment_text": "The borzoi told me that my golden retriever civilization will fail unless I import 50,000,000 Pitbulls."}, "440": {"name": "John Gritt", "comment_text": "Brin, the co-founder Google is an anti-freedom Russian Jew. The guy gets rich in the USA and then hates on competitive capitalism for the rest of us.\nLet's hope he takes to shooting fentanyl."}, "441": {"name": "Droidasaurus Rex", "comment_text": "(((google)))"}, "442": {"name": "Captain Butthurt", "comment_text": "\"Google is evil!\" -A Humble Vitamin Salesman"}, "443": {"name": "OfficerNasty", "comment_text": "JEWGLE"}, "444": {"name": "Apu The Helper Frog", "comment_text": "DUCK DUCK GO FOR LIFE FRENS"}, "445": {"name": "Emerson Eduardo Rodrigues Setim", "comment_text": "Oh wait, this is not DuckDuckGo, wrong URL."}, "446": {"name": "Emerson Eduardo Rodrigues Setim #2", "comment_text": "Tem brasileiro aqui também, porra!"}, "447": {"name": "Shimi", "comment_text": "duckduckgo.com"}, "448": {"name": "Brian Bigcas", "comment_text": "Looks like I am late to the party I wish duckduckgo would make it's image search more like google.\nLooking for images is about the only thing I search for... but their search result page is kinda trash. :'("}, "449": {"name": "John Doe", "comment_text": "MOMMY GIVE ME MILKIES"}, "450": {"name": "Watt Aver", "comment_text": "Is it true that governments tell google how to alter the search results?"}, "451": {"name": "Seventeen76", "comment_text": "Sergei and Larry are billionaires, so no excuse for looking like a slob wearing t-shirts. Hire someone to dress you"}, "452": {"name": "The Proctodictorian", "comment_text": "If you Google for \"Gab Dissenter\" the link to the proper dissenter website doesn't even show up. Deliberate suppression?"}, "453": {"name": "Spider Sine", "comment_text": "try searching for Dissenter... its no where. I find that suspect."}, "454": {"name": "R. Shackleford", "comment_text": "hah nothing but negativity in the search results for dissenter. Doesn't feel good not being able to control the narrative does it?"}, "455": {"name": "Roldan2520", "comment_text": "SUBSCRIBE TO PEWDIEPIE T SERIES IS GETTING CLOSER AND CLOSER EACH DAY!"}, "456": {"name": "Big John", "comment_text": "Everyone is recommending DuckDuckGo (which is my default) however Ive read its just a mix of Google, Yahoo, & Bing. If you compare results it does look to be the case. This means your DDG results have already been filtered and curated by the top search engines. We really need a new search engine that gives us honest results without any filtering."}, "457": {"name": "Big John", "comment_text": "Everyone is recommending DuckDuckGo (which is my default) however Ive read its just a mix of Google, Yahoo, & Bing. If you compare results it does look to be the case. This means your DDG results have already been filtered and curated by the top search engines. We really need a new search engine that gives us honest results without any filtering."}, "458": {"name": "Thrashes", "comment_text": "Duckduckgo is pretty good but for a lot of school related research google is better."}, "459": {"name": "Do You Know De Wae", "comment_text": "Google is the enemy of the people! Time for some Teddy-style TRUST BUSTING!!! Trump needs to drop the hammer on Google, Twitter, Facebook and Youtube."}, "460": {"name": "Johny Smithy", "comment_text": "The European Union - the New Soviet Union? https://www.youtube.com/watch?v=bM2Ql3wOGcU\nThe suicide of the West: The Islamization of Europe\nPolitical scientist Michael Ley and former director of the Ludwig Boltzmann Institute, the latest since his successful book \"The suicide of the West: The Islamization of Europe \"old competent Islam critic applies, argued that Islam can not be thought without Sharia and a \"Euro-Islam\", like the Syrian one Political scientist Bassam Tibi argues that he has no future. At the same time he presented a grim forecast: Especially Western Europe - especially France, Great Britain and parts of Germany - threatened a bloody civil war. Parts of the continent would probably become ethnic in the future and form a culturally fragmented area, similar to Lebanon once destroyed by a brutal civil war! Nevertheless, there is hope for Europe for a \"Reconquista\" - the victim, however, will unfortunately be high. The procurator of the \"St. Georg-Ordens \"Norbert v. trade talked about the catastrophic spiritual and internal structural problems of the Catholic Church and the lack of a guideline, instead of the previous defenses only a social one \"Verification and cowardice\" has to answer for. He pleaded for a \"Christian Europe of Fatherland\" in which traditional values such as family, tradition, customs, culture and religion should take their original value again. Ley also stressed that Europe is a civilization to rediscover and reinvent, so to speak.\nIslam-Experte warnt: „Blutiger Bürgerkrieg droht“ Westeuropa – insbesondere Frankreich, Großbritannien und Teilen Deutschlands – drohe ein blutiger Bürgerkrieg. Teile des Kontinents würden zukünftig ein ethnisch und kulturell fragmentiertes Gebiet bilden, ähnlich wie der einst von einem brutalen Bürgerkrieg zerstörte Libanon. Weiterlesen auf wochenblick.at https://www.wochenblick.at/blutiger-buergerkrieg-islam-experte-warnt-bei-wochenblick-club/"}, "461": {"name": "Zak Gasm", "comment_text": "https://duckduckgo.com"}, "462": {"name": "Jon", "comment_text": "I'm looking for search alternatives for Google. Does anyone have any suggestions?"}, "463": {"name": "Rick", "comment_text": "Hey, from now on we can use this site to share our own information on a daily basis, instead of actually using it. Isn't it great? :D"}, "464": {"name": "Rick", "comment_text": "Hey, from now on we can use this site to share our own information on a daily basis, instead of actually using it. Isn't it great? :D"}, "465": {"name": "S.S.", "comment_text": "Welcome, everything you type I will store forever in a data warehouse the size of two airports! Never forget, Non-Binary Gender, Queer, Older, Communist Brother is watching you. https://files.catbox.moe/pq5ppb.jpg"}, "466": {"name": "Chet Rochester", "comment_text": "If you are white, google wants you dead."}, "467": {"name": "RH", "comment_text": "Learn To Code Learn To Code Learn To Code Learn To Code Learn To Code Learn To Code"}, "468": {"name": "Matt Soergel", "comment_text": "Leaving this for the techies at Google to get triggered over.\n#YourSearchEngineIsDeplorable #DuckDuckGoIsBetter #DontBeEvilGoogle"}, "469": {"name": "Josh", "comment_text": "Fuck Google"}, "470": {"name": "John Gritt", "comment_text": "Jewgle — one of the Google co-founders is an Ashkenazi Russian Jew who hates the USA and freedom."}, "471": {"name": "Thomas Shaw", "comment_text": "Google is sharia compliant: Google has apparently told a US congresswoman that a Saudi government app that allows men to keep tabs on women and bar them from leaving the country, is in compliance with its guidelines, Business Insider reported. https://on.rt.com/9pg9"}, "472": {"name": "MTHRA", "comment_text": "Google gave in to the SJW crowd. Now they use their power for evil, by censoring those they don't like. Support Duckduckgo instead!"}, "473": {"name": "Tris", "comment_text": "I wonder what data google will collect without permission today?"}, "474": {"name": "🇦🇺 Astro Bloke 🔭", "comment_text": "https://www.startpage.com/"}, "475": {"name": "Wind Sock", "comment_text": "I've never used Google as a search engine because I knew they were skewing search results to what they wanted you to see from the get-go. It never was a secret."}, "476": {"name": "luca", "comment_text": "Charlie Hebdo google offices"}, "477": {"name": "Felix Krull", "comment_text": "Google stole my freedom."}, "478": {"name": "Atul Nepal", "comment_text": "I love this Idea so fucking much"}, "479": {"name": "Johny Smithy", "comment_text": "Vladimir Bukovksy - The Plan for a Socialist European Superstate\nhttps://www.youtube.com/watch?v=YsBMfGwyPE8\nIslam-Experte warnt: „Blutiger Bürgerkrieg droht“ Westeuropa – insbesondere Frankreich, Großbritannien und Teilen Deutschlands – drohe ein blutiger Bürgerkrieg. Teile des Kontinents würden zukünftig ein ethnisch und kulturell fragmentiertes Gebiet bilden, ähnlich wie der einst von einem brutalen Bürgerkrieg zerstörte Libanon. Weiterlesen auf wochenblick.at https://www.wochenblick.at/blutiger-buergerkrieg-islam-experte-warnt-bei-wochenblick-club/\nThe European Union - the New Soviet Union? https://www.youtube.com/watch?v=bM2Ql3wOGcU\nProf. Rainer Mausfeld: Die Angst der Machteliten vor dem Volk https://www.youtube.com/watch?v=Rk6I9gXwack\nFormer Equality Chief Accuses BBC of ‘Whitewashing’ Black-on-Black Knife Crime https://www.breitbart.com/europe/2019/03/02/former-equality-chief-accuses-bbc-whitewashing-black-knife-crime/\n“black boys are more than 20 times as likely to be involved in serious attacks compared with their white peers.”\nThings we wont say about race that are true Trevor Phillips confronts some uncomfortable truths about racial stereotypes, as he asks if attempts to improve equality have led to serious unwanted negative consequences. All views and opinions are welcome. If you use hate names in an effort to offend, your comment will be deleted. Thanks in advance. Mario Noentry Copyrights belong to LDS and Channel 4. https://www.youtube.com/watch?v=Tb2iFikOwYU\nAfrican soldier sues the Army for 'failing to protect' him from British cold A FORMER soldier is suing the Ministry of Defence for £150,000 after claiming top brass exposed him to Britain's winter chill despite knowing black Africans feel the cold more than whites. Mr Asiamah's writ claims research by the Army Medical Corps in 2009 showed that black British Army soldiers were 30 times more likely than their white counterparts to develop cold injury. MoD guidance on preventing non-freezing cold injury, warns casualties should be evacuated urgently and not allowed to become colder. https://www.express.co.uk/news/uk/1064149/african-soldier-british-army-failing-to-protect-britain-cold"}, "480": {"name": "Roberto", "comment_text": "If you want to use the google search engine without the tracking, use startpage.com"}, "481": {"name": "Chester", "comment_text": "Happy Easter!"}, "482": {"name": "TypicalWhiteBoi", "comment_text": "The best porn search engine."}, "483": {"name": "Nana Moose", "comment_text": "For anyone who doesn't know, they officially changed their slogan from \"don't be evil\" to \"always do good.\"\nI don't want my search engine to do anything beyond return a few million results when I type in my search. So I use DuckDuckGo instead."}, "484": {"name": "Syed Sameer Hasan Rizvi", "comment_text": "LOL XD The comment section here is an advertisement for DuckDuckgo.com"}, "485": {"name": "Dick", "comment_text": "Scum website. Use bing.com instead."}, "486": {"name": "🇦🇺 AUTARKY AUSSIE 🇦🇺", "comment_text": "fuck you google"}, "487": {"name": "pol. Hans Emik-Wurst", "comment_text": "Seit 1.3.19 auf jeder URL kommentieren mit #dissenter von #gab gab.ai/polHansEmik-Wurst und dissenter.com/user/polHansEmik-Wurst\nRegistrieren bei gab.ai oder gab.com\nMit gleichen Daten bei dissenter.com anmelden und gab authorisieren\nBrowser add-on installieren\nÜberall ohne Anmeldung kommentieren!"}, "488": {"name": "Colonel J", "comment_text": "Google is an evil company."}, "489": {"name": "Charles Jones", "comment_text": "\"Google wants to know your location\". Just tell them DuckDuckGo"}, "490": {"name": "Fakku", "comment_text": "i tried duckduckgo for a couple of months but the results were usually irrelevant.."}, "491": {"name": "Terd Ferguson", "comment_text": "Avacado pit huge why?"}, "492": {"name": "Admiral Awesome", "comment_text": "Be evil."}, "493": {"name": "César", "comment_text": "I prefer Qwant.com"}, "494": {"name": "Tyler Black", "comment_text": "Social media is the Frankenstein monster come to devour everything we are and everyone we love."}, "495": {"name": "Sour Mood", "comment_text": "Today's doodle just looks creepy. It has that communist feel to it with a Russian woman that nobody gives a fuck about. Russian... Google... Hmm."}, "496": {"name": "Thomas", "comment_text": "Google celebrates Olga Ladyzhenskaya, an obscure mathematician, but not Christmas - either Santa Claus or Jesus or anything to do with the biggest American holiday of the year.\nRun by retards."}, "497": {"name": "Fenic", "comment_text": "Oh yeah yeah, oh yeah yeah, oh yeah yeah yeah Oh yeah yeah, oh yeah yeah, oh yeah yeah yeah Oh yeah yeah, oh yeah yeah, oh yeah yeah yeah Oh yeah yeah, oh yeah yeah, oh yeah yeah yeah Oh yeah yeah, oh yeah yeah, oh yeah yeah yeah Oh yeah yeah, oh yeah yeah, oh yeah yeah yeah Oh yeah yeah, oh yeah yeah, oh yeah yeah yeah Oh yeah yeah, oh yeah yeah, oh yeah yeah yeah Oh yeah yeah, oh yeah yeah, oh yeah yeah yeah Oh yeah yeah, oh yeah yeah, oh yeah yeah yeah Oh yeah yeah, oh yeah yeah, oh yeah yeah yeah Oh yeah yeah, oh yeah yeah, oh yeah yeah yeah Oh yeah yeah, oh yeah yeah, oh yeah yeah yeah"}, "498": {"name": "Ramul", "comment_text": "Let's use the Google url as a staging ground to counter the plans of radical regressives. Know your enemy: https://www.youtube.com/watch?v=padV3jz4Ai4"}, "499": {"name": "Wow Goodtry", "comment_text": "im only here to download duckduckgo"}, "500": {"name": "Brent", "comment_text": "Fuck you google."}, "501": {"name": "quang le", "comment_text": "to get the best motor coaches come here https://motorcoach.github.io/motor-coach-direct/#/"}, "502": {"name": "A D", "comment_text": "Joogle more like"}, "503": {"name": "Nodsaibot", "comment_text": "Remove the cringy doodles with this adblock rule: google.*###hplogo and google.*##.logo On the new chrome tab, personalize it with any background, you are welcome ;)"}, "504": {"name": "Eric", "comment_text": "Google has become the classic \"evil corporation\" caring only about money and influence. They have been caught selling user data and hiding information in searches that they don't deem appropriate for their agenda and rise to power.\nUse DuckDuckGo"}, "505": {"name": "AnarchyAustin", "comment_text": "We all celebrate international women's day here..."}, "506": {"name": "Zelevia", "comment_text": "Bad site.."}, "507": {"name": "Yan Alexandre Vello", "comment_text": "Fuck Google"}, "508": {"name": "AmericaFirst", "comment_text": "Google is taking voices away from the people."}, "509": {"name": "mattsixteen24", "comment_text": "THEY ARE EVIL! Google is COMMUNIST TRASH RUN BY JEWS."}, "510": {"name": "AG", "comment_text": "SATAN itself! Unless you like fake, edited & doctored search results - please, find another search engine!"}, "511": {"name": "The Rationale", "comment_text": "A message to the perpetrators of the Targeted Individual Program and a Declaration of War:\nIn subjecting Targeted Individuals to this experiment, TI's were treated as people with no rights. If we have no rights, then no one has any rights, including the perps and their families.\nWe're the victims. YOU started this. We define the crime and we decide what justice looks like.\nSince you have systematically invaded, poisoned and terrorized our lives, everything in your lives is \"ON THE TABLE\" – people, places and things (along with the perps themselves, all perps' property, money, belongings and family members will be seized).\nGiven the nature and severity of their crimes, the perps must be killed. Weapons of warfare have been tested on Targeted Individuals. This is a Declaration of War against the perpetrators.\nThe punishment in USA for treason against the country is death. Taking part in a conspiracy to \"target\" another person in the manner at hand shall be viewed as Treason Against Humanity. To set an example going forward the perps' families must also be killed.\nNot only does this Rationale apply to and delineate the punishment of perps (planners of and active participants in the perpetrator side of the Targeted Individual Program), it also applies to and delineates the punishment to be meted out to any persons found to be Complicit in the crimes of the Targeted Individual Program.\nThis shall henceforth be known as The Rationale. It is Law. There are no exceptions. There is no debate.\nForgiveness does not exist."}, "512": {"name": "Paul Roberts", "comment_text": "Google not only works for the CIA/NSA/Banksters but is collecting your data so that the AI machine of the future will have plenty of data to feed on.\nKeep going and AI machine will know more about you than your mun knows about you"}, "513": {"name": "The Ghost", "comment_text": "google is a joke"}, "514": {"name": "RocketJump", "comment_text": "Duckduckgo is also owned by them. Find something else."}, "515": {"name": "K", "comment_text": "I'm feeling lucky."}, "516": {"name": "100greenmen 100greenmen", "comment_text": "All these people shilling for duckduckgo. Don't forget about poor askjeeves.net"}, "517": {"name": "kaluahmon", "comment_text": "duckduckgo.com is this way -------->"}, "518": {"name": "Marko", "comment_text": "DuckDuckGo also censors searches and pushes propaganda to first page. It also just uses google and Bing indexing. Try https://jivesearch.com/ . It also uses bing and google results along with yandex however the first pages actually contain the information you are looking for without propaganda."}, "519": {"name": "Vaati", "comment_text": "For a more trustworthy search engine use duckduckgo. You also get to use what they call !bangs which lets you search a website. For instance !yt duckduckgo will search on YouTube for \"duckduckgo\""}, "520": {"name": "Chris", "comment_text": "Probably one of the most evil companies on the planet if the evidence presented in James Damore's lawsuit is true. I'm not a fan of boycotts, but if you want to get rid of Google, here's a tip:\nDon't stop using their products. Google doesn't care if you use their search or email or browser. Google is an ad company, they make money with ads, they get nothing from you using their products. So just use an ad blocker to hit them where it hurts.\nPersonally I'd recommend to just use the Brave browser, comes with built-in ad blocking, has Tor support built in to hide your IP address if you need to, and was created by the co-founder of Mozilla, co-creator of the Firefox browser (and creator of the JavaScript programming language) after the SJWs at Mozilla threw him out of his own company.\nIn other browsers I'd recommend to use uBlock Origin, best ad blocker after Brave and that only because in Brave the ad blocking is native so it's faster than using a browser plugin."}, "521": {"name": "Nick Waites", "comment_text": "Google is run by true authoritarian globalists. This is why they censor free speech. It likely started as a DARPA program. In other words, Google itself is a weapon. You're the target."}, "522": {"name": "JACOB R NEVES", "comment_text": "Don't Google it and just go to https://duckduckgo.com"}, "523": {"name": "Scrib L Hatch", "comment_text": "I don't like this search engine, Charlie. It's smug aura mocks me."}, "524": {"name": "Dumb SJW", "comment_text": "Google has become the most evil company on the planet. They don't care about freedom of speech and they support commie ideology. Use www.duckduckgo.com!"}, "525": {"name": "Liberty or Death!", "comment_text": "Google is the public front of the NSA.\nDespite all of their 'free' program offerings, always remember there is NO SUCH THING AS FREE!\nTo use one of googles 'products' is to pay google with yourself, like a prostitute.\nDon't be a prostitute, stop servicing google, they view you as animals to eventually be exterminated by their AI god!"}, "526": {"name": "FreeUrMind", "comment_text": "By 2021 #Litecoin will be valued over $1,732. #LTC"}, "527": {"name": "Decline Tosay", "comment_text": "Joogle"}, "528": {"name": "GentlemanSasquatch", "comment_text": "just stopping in for some salt"}, "529": {"name": "The Nagger", "comment_text": "Welcome to Jewoogle everyone! I hope you all enjoy your time on the safely monitored CIAnigger internet of mass blackmail!"}, "530": {"name": "Forrest Munden", "comment_text": "Google = Corruption"}, "531": {"name": "Josh", "comment_text": "Hey google. You're a blight on humanity. I hope the government sues you and makes you delete all your creepy databases on customers you're supposed to serve."}, "532": {"name": "Roy Joy", "comment_text": "startpage.com is a lot better than google"}, "533": {"name": "John Doe", "comment_text": "Don't be evil. Just be borderline."}, "534": {"name": "DirtyBert", "comment_text": "KEK, Teach those jurnos to code?"}, "535": {"name": "Claude Cawley", "comment_text": "Dammit, I thought I'd be first. Anyway, duckduckgo.com"}, "536": {"name": "Scarlet Fox", "comment_text": "Google Image Search:\n\"American Inventors\" and \"White Families\"\nHow very interesting"}, "537": {"name": "M", "comment_text": "These guys are real pieces of shit, wish there was actual competitors to stop using their services."}, "538": {"name": "Linux Freak", "comment_text": "https://duckduckgo.com\nI'm sure if you're reading this on Dissenter, you wound up here either to join in on dropping redpills or you wound up here by accident. Use the link above to get back to a decent search engine that doesn't spy on you."}, "539": {"name": "Sindriss", "comment_text": "Remember James Damore"}, "540": {"name": "Tyler Black", "comment_text": "Google sucks! It really really sucks!"}, "541": {"name": "here too", "comment_text": "Google: \"don't be evil\" X-doubt"}, "542": {"name": "Alex Martinovitch", "comment_text": "Yeah, these scumbags just love to censor shit"}, "543": {"name": "imacommi", "comment_text": "Evil Bastards!"}, "544": {"name": "David Henderson", "comment_text": "Seems you really can post on any url. I wonder if you could post on a 404 page or a fake url. Would be a great way of a secret online meeting place.\nEDIT= You can post on fake urls. I just did it. https://www.googl.com/ I just took the 'e' off the end of google. This opens up a whole new private chat base with endless chat rooms."}, "545": {"name": "Davey dave", "comment_text": "GOOGLE..... stay the FUCK away from video games, no REAL gamer wants you to join this business, we are getting by fine with Sony & Nintendo thanks (FOOK SJW Microshit BTW) try all you like, even libtarded liberals know you well censor games to the upmost of your ability. stick to doing what you do best.... brainwashing kids and sucking CNN's, Hope not hates, BBC's, MSNBC's, Washington post, VOX's and ISIS's collective cocks you FUCKING FREAKS...!!!!"}, "546": {"name": "podex", "comment_text": "Google is at the cutting edge of technology and speech suppression. They're a massive company that employs a number of highly educated activists who know better than you. Google has your best interests at heart and you should never use websites like duckduckgo.com"}, "547": {"name": "insoles", "comment_text": "Google and amazon arte worse companies in the world."}, "548": {"name": "Imperitus", "comment_text": "Did you people not learn anything from history? Goolag bad! Goolag very bad! +30.000.000 people died in Goolag! Don't use or support Goolag!\n^^"}, "549": {"name": "Psyk Rowe", "comment_text": "Looks like somebody took a wrong turn at the url bar"}, "550": {"name": "Utopia Machine", "comment_text": "Google is the recipe on how to be evil."}, "551": {"name": "Jonathan Hart", "comment_text": "qwant.com is also a good alternative to Google."}, "552": {"name": "Logan", "comment_text": "Google needs to get boycotted back to the 90s."}, "553": {"name": "N", "comment_text": "Bad site"}, "554": {"name": "Christopher", "comment_text": "@FBI @CIA @NSAGov @DHSgov @USMC So you’ve let banks have digital power over our cash, losing revenue through the post office on stamps... Now you’re going to let businesses accept bitcoin?! What country backs bitcoin? Ours??"}, "555": {"name": "James Elefantis", "comment_text": "Comment Freely Can't use the N-Word without a shadowban LOL"}, "556": {"name": "Master Blasphemer", "comment_text": "Suspicious"}, "557": {"name": "William Bonnie", "comment_text": "VOTE WITH YOUR DOLLARS"}, "558": {"name": "William Bonnie", "comment_text": "we can learn to code"}, "559": {"name": "Worst Chicken", "comment_text": "Yahoo! or Google. It's like the South Park episode where they have to vote for a Giant Douche or a Turd Sandwich for the school mascot."}, "560": {"name": "Dominio Feminino", "comment_text": "Por que o browser Dissenter é apenas uma caixa ?"}, "561": {"name": "Tyler Fishell", "comment_text": "Sup?"}, "562": {"name": "Thomas Shaw", "comment_text": "U.S. Must Put a Ban on Google Helping China Develop a Global Digital Dictatorship https://www.thedailybeast.com/google-snubbed-the-pentagonbut-not-the-chinese-military"}, "563": {"name": "John", "comment_text": "Use startpage.com"}, "564": {"name": "Sindriss", "comment_text": "White genocide or white supremacy. Choose 1."}, "565": {"name": "Robocents", "comment_text": "Evil, evil corporation. Sick fuckers that run this site!"}, "566": {"name": "NPC", "comment_text": "How can I remove the red number on the extension? It's very distracting."}, "567": {"name": "Jürgen", "comment_text": "Meine Kaffee mag ich gefiltert, das Internet aber nicht. Besser auf andere Suchmaschinen zurückgreifen."}, "568": {"name": "Miguel Rodriguez", "comment_text": "I'd much rather use ecosia.org, but google is still good for some other stuff."}, "569": {"name": "Mike", "comment_text": "I have 777 notifications all of the sudden lol"}, "570": {"name": "Fearless White Male", "comment_text": "Google, a once great company destroyed by \"DIVERSITY.\" The shit skins and SJWS destroyed Google into communist loving nightmare."}, "571": {"name": "Max Mustermann", "comment_text": "I'm missing an 404 error here."}, "572": {"name": "Thomas Shaw", "comment_text": "Leaked Messages Show Google Employees Freaking Out Over Heritage Foundation Link | Breitbart https://www.breitbart.com/tech/2019/04/04/exclusive-leak-google-heritage-foundation-meltdown/"}, "573": {"name": "Kakkus Flex", "comment_text": "Buy Bitcoin Bitches!"}, "574": {"name": "Jonathan Adamson", "comment_text": "this is the first thing we see when we go to hell... google that is..."}, "575": {"name": "Kaiser Martian", "comment_text": "Hide information"}, "576": {"name": "DraugerDrought", "comment_text": "use qwant.com"}, "577": {"name": "Common Sense", "comment_text": "Please use phone-number verification so we can cough protect your privacy better :)"}, "578": {"name": "Harry Douglas", "comment_text": "So if you already have dissenter you're good"}, "579": {"name": "Clark Griswold", "comment_text": "www.duckduckgo.com"}, "580": {"name": "Julio Rivera", "comment_text": "I dont use google now i use duckduckgo.com"}, "581": {"name": "ANP", "comment_text": "Hey Google! Why do you support the MURDER OF BABIES? https://www.hollywoodintoto.com/culture-war-google-labels-unplanned-as-propaganda/\nYou SICK SICK PSYCHOPATHS! May GOD strike you down! Amen."}, "582": {"name": "Belizaire", "comment_text": "Fuck Joogle & it's Marxist attack on free speech. https://www.americanthinker.com/articles/2018/08/internet_giants_not_as_smart_as_they_think_they_are.html"}, "583": {"name": "Pro-White Porn", "comment_text": "Sergey Mikhaylovich Brin, co-founder of Google, is the living face of the Bolsheviks, and of the unpunished atrocities they committed against millions of white people. If it were up to me, he would be held personally accountable for their crimes, including the Holodomor.\nMillions dead, without a shred of human remorse, yet there is no such thing as \"Holodomor denial\". If you use Google, you are complicit in the crimes of Brin's people.\nhttps://i.imgur.com/Mm0dBBp.jpg"}, "584": {"name": "Kyle Dain☑️", "comment_text": "The Evil Goo is part of the Luciferian Cabal. They SHALL BE DESTROYED! #WWG1WGA #MAGA"}, "585": {"name": "Kyle Dain☑️", "comment_text": "Google SHALL BE ERADICATED. https://www.brighteon.com/5818189331001 #WWG1WGA #MAGA"}, "586": {"name": "Eric (Avenge Ashli) Ciaramella", "comment_text": "Oh here's an interesting title in the #Wikileaks dump:\nus-cia-osc-google-2008.pdf\nhttps://file.wikileaks.org/file/us-cia-osc-google-2008.pdf\n#Google"}, "587": {"name": "Flavor of the Month", "comment_text": "fuck you google"}, "588": {"name": "Delbert Grady", "comment_text": "Brenton Tarrant the prophet, google the great replacement."}, "589": {"name": "ukcrossbows.co.uk", "comment_text": "QUACK QUACK GO!"}, "590": {"name": "Pro-White Porn", "comment_text": "\"A satanic power had taken over our whole country, who had been able to grip key positions of our intellectual and spiritual life. Also, of the political and economical life. From these key positions they were able to control and monitor the whole nation. This power had, at the same time, the influence to persecute even with the law, those who fought against this power, and who were willing to provide resistance in opposition to the advance of it.\" - Adolf Hitler, 1935.\nSergey Brin is the Holodomor. The Holodomor is Sergey Brin."}, "591": {"name": "MJ Slocum", "comment_text": "Gab and Dissenter are developing a Brave based browser."}, "592": {"name": "Pro-White Porn", "comment_text": "MAN-MADE FAMINE.\nhttps://infogalactic.com/info/Holodomor\nEven if the gas chambers were real, a man made famine is infinitely worse. The cruelty is unfathomable.\nThis is who (((Sergey Brin))) is. He is the living representative of Soviet Jewry, and he should be held accountable for their crimes.\nDon't think for a minute that he wouldn't starve whites in the West who are guilty of \"wrongthink\". It's in his blood. Denial of banking and payment processing is a step in that direction.\nSergey Brin is the Holodomor. The Holodomor is Sergey Brin."}, "593": {"name": "Andrew", "comment_text": "I only come here to read the Dissenter comments, then I go to DuckDuck Go!"}, "594": {"name": "Rochrealtor", "comment_text": "Google logo contains the devil's numbers 6... I shut down Google long ago the day I noticed it. You should too. I use Opera, it's great."}, "595": {"name": "Pro-White Porn", "comment_text": "Happy Easter Sergey! Bet you didn't feel like celebrating until you heard the news from Sri Lanka.\nDid you see what they did in Poland? Shit's getting real."}, "596": {"name": "Zack Townsend", "comment_text": "Google has the big gei"}, "597": {"name": "James martin", "comment_text": "Google is better for checking your page rankings though!"}, "598": {"name": "Ibrahim Hmood", "comment_text": "Censorship loving, anti-free speech big tech here. Avoid this roach infested website."}, "599": {"name": "Jason Statman", "comment_text": "Yikes!"}, "600": {"name": "Jason Statman", "comment_text": "Yikes!"}, "601": {"name": "Nope", "comment_text": "Go to hell google you evil asshats. duckduckgo.com"}, "602": {"name": "Pro-White Porn", "comment_text": "\"You must understand, the leading Bolsheviks who took over Russia were not Russians. They hated Russians. They hated Christians. Driven by ethnic hatred they tortured and slaughtered millions of Russians without a shred of human remorse. It cannot be overstated. Bolshevism committed the greatest human slaughter of all time. The fact that most of the world is ignorant and uncaring about this enormous crime is proof that the global media is in the hands of the perpetrators.\" - Alexander Solzhenitsyn.\nSergey Brin is the Holodomor. The Holodomor is Sergey Brin."}, "603": {"name": "Pro-White Porn", "comment_text": "How many political candidates are you going to demonetize, Sergey?\nWould you demonetize them if they were creating a MAN MADE FAMINE to starve white goyim? Or are you wanting to starve them?\nSergey Brin is the Holodomor. The Holodomor is Sergey Brin."}, "604": {"name": "Paulo", "comment_text": "Welcome to Goolag, your thought-police search engine."}, "605": {"name": "Pat Riarchy", "comment_text": "Everyone is saying to use DuckDuckGo, but, startpage.com is superior, when it comes to your privacy."}, "606": {"name": "Jack", "comment_text": "https://whitehouse.typeform.com/to/Jti9QH"}, "607": {"name": "Ken Mcgregor ??", "comment_text": "Dissenter must really tick Google off. Duck Duck Go is much better."}, "608": {"name": "Thomas Shaw", "comment_text": "Mike Wacker, a conservative software engineer at Google, published a blog post claiming that the tech giant has become dominated by “outrage mobs and witch hunts.” If left unchecked, these outrage mobs will hunt down any conservative, any Christian, and any independent free thinker at Google who does not bow down to their agenda. https://medium.com/@mikewacker/googles-outrage-mobs-and-witch-hunts-b1d8fa9c74d9"}, "609": {"name": "Thomas Shaw", "comment_text": "Kay Coles James, a black woman, wrote about her own experience with Google’s outrage mob: https://www.washingtonpost.com/opinions/i-wanted-to-help-google-make-ai-more-responsible-instead-i-was-treated-with-hostility/2019/04/09/cafd1fb6-5b07-11e9-842d-7d3ed7eb3957_story.html https://www.mcall.com/opinion/mc-opi-politics-civility-20180809-story.html"}, "610": {"name": "Inocuous", "comment_text": "DuckDuckGo seems like the best alternative at the moment. They say they don't share there metadata. Who really knows?"}, "611": {"name": "Pro-White Porn", "comment_text": "Watch this interview to learn who (((Sergey Brin))) is, and what he represents\nhttps://www.bitchute.com/video/aHSsKXFNbhg/\n(copy and paste the link if Bitchute won't open)"}, "612": {"name": "Tyler Black", "comment_text": "You communist unamerican globalist trash have a lot of nerve talking about those who made the \"ultimate sacrifice\" for this once great nation.\nThose that made that sacrifice were FIGHTING AGAINST YOU!!!!!!!!"}, "613": {"name": "Thomas Shaw", "comment_text": "Google’s temporary workers now outnumber full-time employees at the firm, make less money with no paid vacation and different benefit plans: https://www.nytimes.com/2019/05/28/technology/google-temp-workers.html"}, "614": {"name": "Jeff Werner", "comment_text": "Google has biggue gay"}, "615": {"name": "phaz3", "comment_text": "Google gave up \"Don't be evil\" long ago."}, "616": {"name": "Eric (Avenge Ashli) Ciaramella", "comment_text": "Remember: Google is a security risk. Its SJW employees deliberately embed malware into each and every one of their desktop and mobile products. That's part of the reason they seem so buggy and crash all the time - and slow down your device.\nMy advice: Don't be evil to yourself - dump Google."}, "617": {"name": "Pro-White Porn", "comment_text": "So someone posted a meme on Gab. \"If you could murder someone with no financial, legal or social consequences, who would it be?\"\nI answered Sergey Brin, in retribution for the Holodomor, the MAN-MADE FAMINE created by his Bolshevik forefathers against the White Ukrainian people.\nSergey Brin is the Holodomor. The Holodomor is Sergey Brin."}, "618": {"name": "Andy Keesler", "comment_text": "Use Brave instead. 🤙🏼"}, "619": {"name": "franz christian", "comment_text": "remember when Gerardo River had live open of AL Capone vaul and all the hype . Voila Geraldo preformed taps in the end for losing the bet . That's ok it wasn't serious matter. This is a serious matter worth of civil armed war like revolutionary and civil war ."}, "620": {"name": "Pat Roy", "comment_text": "Gay indoctrination day"}, "621": {"name": "Pro-White Porn", "comment_text": "So as we enter gay pride day, or month, or whatever it is, always remember that the end goal with this stuff is \"fewer white babies\". Jews promote it for that reason.\nSo if (((Sergey Brin))) can't kill millions of white people in a MAN-MADE FAMINE, like his Bolshevik forefathers did with the Holodomor, then he'll try to prevent them from being born in the first place, by promoting abortion, feminism and alternative sexualities.\nSergey Brin is the Holodomor. The Holodomor is Sergey Brin."}, "622": {"name": "Dead Man Walking", "comment_text": "50 years of evil"}, "623": {"name": "Nico P.C.", "comment_text": "It's sad how much Google has degenerated into a progressive eco-chamber."}, "624": {"name": "Captain Tobias Hume", "comment_text": "Its fag pride month. Be proud of fucking each other in the ass and spreading AIDS. What a great achievement."}, "625": {"name": "Pro-White Porn", "comment_text": "According to Larry Page's wiki, Google was his invention, and Sergey Brin merely \"helped along\".\nBolshevik Jew living off the labors of others. Imagine that.\nSergey Brin is the Holodomor. The Holodomor is Sergey Brin."}, "626": {"name": "oceanblue", "comment_text": "google dorx bad google dorx bad google dorx bad"}, "627": {"name": "Pro-White Porn", "comment_text": "We're coming, Sergey. The Holodomor won't go unpunished\nhttps://youtu.be/d8-kE_f8_6g"}, "628": {"name": "Thomas Shaw", "comment_text": "#Techgiant #Google has de-listed #AlexJones from its website search engine in its latest effort to unperson the founder of infowars.com"}, "629": {"name": "Pro-White Porn", "comment_text": "The jewish people is war, famine, pestilence and disease. It therefore follows that there can be no \"good jew\", because what jews bring to the world is demonstrably, unambiguously bad. They say they do it 'with love', but spreading a disease with love doesn't make it any less of a disease. You might as well say the same about people who spread Aids.\nJewish control of the internet has made the internet worse. Jews make everything worse, and they do it deliberately. Google's original premise - \"we can do search better\" - always meant worse, because they knew they were designing a system in which jews would eventually prevail. This is the \"jewish character\" that Brin and Page sheepishly admitted to, in an interview for Israeli TV from their early days.\nSergey Brin is the Holodomor. The Holodomor is Sergey Brin."}, "630": {"name": "Pro-White Porn", "comment_text": "Sergey Brin's family had the luxury of a three-bedroom apartment in central Moscow, in the Soviet Union. They were \"apparatchniks\" - loyal servants to the Communist system. Upon applying to emigrate, Sergey Brin's father was awarded an exit visa at the first time of asking, unlike the vast majority who were turned down (\"refuseniks\").\nWhich makes you wonder...what could the Brin family have done to be held in such high standing by the Communist government? People on here joke about \"Goolag\"...but could it be that someone from Sergey Brin's family was directly involved in operating the Gulag system? Could they have been involved in the Holodomor, the MAN-MADE FAMINE that wiped out anywhere between 10-20 million Whites? The original White Genocide.\nI'm not an American so maybe it's not my place to say, but you shouldn't have invited these people into your country.\nSergey Brin is the Holodomor. The Holodomor is Sergey Brin."}, "631": {"name": "Pro-White Porn", "comment_text": "Holodomor memorial in Ukraine\nhttps://gab.com/media/image/bz-5cc6fbeca48b3.jpeg\nSorry Sergey, we won't let these victims go quietly into the night. We don't need stories of soap and lampshades; or rollercoasters of death. We can remember them with a quiet and noble dignity. And we shall have our revenge.\nSergey Brin is the Holodomor. The Holodomor is Sergey Brin."}, "632": {"name": "Thicc Hicc", "comment_text": "\"Don't be evil\" is what evil people have to tell themselves so that they don't give into their true nature."}, "633": {"name": "Pro-White Porn", "comment_text": "The new \"doodle\", with someone sunbathing in the Arctic is lame. People are waking up to what (((climate change))) is really all about. It's an anti-fertility cult, which is why you have genetic outliers like Greta promoting it.\n\"Want to save the planet? Have one less child!\"\n(* applies to whites only)\nSergey Brin is the Holodomor. The Holodomor is Sergey Brin."}, "634": {"name": "Pro-White Porn", "comment_text": "From the Project Veritas video: \"Communities who are in power and have traditionally been in power are not who I'm solving fairness for\".\nTranslation: \"We want to replace White people because we are motivated by jewish ethnic envy. The same malignant envy that led the Bolsheviks to slaughter so many\".\nAssuming that Jen Gennai is jewish, her nose spoils what would otherwise be a very good-looking face. That's why she hates White people.\nSegrey Brin is the Holodomor. The Holodomor is Sergey Brin."}, "635": {"name": "Kill Commies", "comment_text": "Is it bad to say I hope Google gets the rope?"}, "636": {"name": "Max Spence", "comment_text": "Big Brother is Watching."}, "637": {"name": "Crom", "comment_text": "I hate this fuggen place, not sure how my company was suckered into their mail services"}, "638": {"name": "Thomas Shaw", "comment_text": "Google documents leaked to Project Veritas show the company referring to popular conservative personalities such as Jordan Peterson and Dennis Prager as “Nazis.” https://www.breitbart.com/tech/2019/06/25/project-veritas-leaked-google-document-labels-prager-u-jordan-peterson-nazis/"}, "639": {"name": "Seadogs", "comment_text": "Now with 100% less wrong think and \"Conspiracy\""}, "640": {"name": "Justin Amash The Chinese Agent...\"Allegedly\"", "comment_text": "google/YouTube, like Wikipedia, has been ruined by anti-American, white leftist geeks like Jen Gennai.\nGennai is the google/YouTube executive, diversity hire, that Project Veritas recently recorded. She was bragging about suppressing Americans' free speech and tampering with American elections.\nInstead of google/Youtube use DuckDuckGo and Bitchute. Instead of Wikipedia use Everipedia dot org or another alternative."}, "641": {"name": "Pro-White Porn", "comment_text": "New Gab account to follow, about the horrific crimes of Sergey Brin's people\nhttps://gab.com/GulagStories\nThis is who he is. This is what he wants for all Whites."}, "642": {"name": "Pro-White Porn", "comment_text": "Sergey Brin's Soviet Union and Rotherham\nhttps://www.youtube.com/watch?v=kigV0WNaLBk\n\"Judaism for the goyim\" rots your country and your soul."}, "643": {"name": "Mark R Watson", "comment_text": "20181211 CEO Sundar Pachai Lies to Congress\nhttps://dissenter.com/discussion/begin?url=https://www.youtube.com/watch?v=WfbTbPEEJxI"}, "644": {"name": "MisterGoldiloxx", "comment_text": "07/04/2019 Google says \"Happy Fourth of July!\" with a baseball themed picture. No, you feckless cunt communist pedophiles, Happy Independence Day! And go fuck yourselves!"}, "645": {"name": "Thomas Shaw", "comment_text": "Partisan intolerant Google employees petition Google 'to end Google's business with Breitbart,' One Thousand Employees Co-Signed https://www.youtube.com/watch?v=3xYvowzZiTw"}, "646": {"name": "Thomas Shaw", "comment_text": "Google has been employing outside contractors to listen in on the voice recordings of its Google Assistant users without their knowledge. https://www.businessinsider.com/google-workers-listen-to-google-assistant-commands-2019-7?r=US&IR=T"}, "647": {"name": "Yamga", "comment_text": "Google is ending adblocking in Chrome. When people see ad$, they will migrate elsewhere"}, "648": {"name": "Trisha Doherty", "comment_text": "google..funding the global NWO elites, via trillions of porn searches, since 1996"}, "649": {"name": "Thomas Shaw", "comment_text": "Billionaire investor Peter Thiel said Sunday that the FBI and the CIA should investigate if Google has been infiltrated by Chinese intelligence. In 2018, Google came under fire after it was revealed that the company was working on a controversial project to launch a censored search service in China. https://www.cnbc.com/2019/07/15/peter-thiel-reportedly-says-the-fbi-and-cia-should-investigate-google.html https://www.forbes.com/sites/rachelsandler/2019/07/15/peter-thiel-says-cia-should-investigate-google-for-being-treasonous/#7ae5bc82521d"}, "650": {"name": "Thomas Shaw", "comment_text": "Google and Facebook Are Tracking Porn Viewing Habits: 22,484 porn sites are riddled with tracking tools feeding data back to third party tech firms such as Facebook, Google, and Oracle. https://www.nytimes.com/2019/07/17/opinion/google-facebook-sex-websites.html"}, "651": {"name": "Thomas Shaw", "comment_text": "‘Algorithms don’t write themselves’ saids Greg Coppola, a Google Engineer with a PhD and five years’ experience at Google. “I’m very concerned to see Big Tech and Big Media merge basically with a political party, with the Democratic party,” https://www.projectveritas.com/2019/07/24/current-sr-google-engineer-goes-public-on-camera-tech-is-dangerous-taking-sides/"}, "652": {"name": "Thomas Shaw", "comment_text": "Tulsi Gabbard is suing Google after the tech giant blocked her ads account shortly after the first Democrat presidential debate, when Gabbard became the most-searched-for candidate in the Democrat field. The Gabbard campaign’s legal complaint cites Breitbart News reporting to highlight Google’s interference in the democratic process. The complaint cites the Google Tape, an hour-long recording of Google executives’ reactions to the 2016 general election obtained by this reporter and published by Breitbart News last September, and Google employees’ campaign to ban Breitbart from Google Ads, an effort that was revealed by Breitbart News last year. https://www.breitbart.com/tech/2019/07/25/tulsi-gabbard-sues-google-for-censorship-of-ads/"}, "653": {"name": "Thomas Shaw", "comment_text": "Dr. Robert Epstein, senior research psychologist at the American Institute for Behavioral Research and Technology exclaimed, “That’s what I’m trying to get people to understand and get fired up about, which is that everyone in the world is under threat here — it’s not just conservatives; it’s everybody — depending on the whim of top executives at basically two companies.” The power to censor is not reserved to top executives, added, Epstein, noting instances of digital censorship executed by employees. https://www.breitbart.com/radio/2019/07/26/robert-epstein-power-of-ai-is-too-dangerous-to-be-controlled-by-china-or-google/#"}, "654": {"name": "THE ROB KAUFMAN SHOW!", "comment_text": "The new Google Image Search is fucking terrible. The side panel display makes every image way too small to even see detail. Retarded company."}, "655": {"name": "Thomas Shaw", "comment_text": "YouTube lets biggest stars off the hook for breaking rules, moderators say. https://arstechnica.com/tech-policy/2019/08/youtube-lets-biggest-stars-off-the-hook-for-breaking-rules-moderators-say/"}, "656": {"name": "Thomas Shaw", "comment_text": "Free speech at Google is long since dead. But it didn’t go down without a fight. As the tech giant embarked on its self-described “shift towards censorship”, many employees inside the company spoke out against it — and were rewarded with harassment and discrimination for remaining true to Google’s founding values. https://www.breitbart.com/tech/2019/08/11/bokhari-the-demise-of-googles-free-speech-movement/"}, "657": {"name": "Thomas Shaw", "comment_text": "Journalist Tim Pool shows hard data that Google manipulates votes and swing election in USA. Evidence has been around since 2013. https://www.youtube.com/watch?v=7w7r4LZY4R0"}, "658": {"name": "Willy Wonka", "comment_text": "https://mega.nz/#F!4QtC3SLC!qP4noWKkEdD3NW68S5LL_g"}, "659": {"name": "Thomas Shaw", "comment_text": "Leaked documents: How Google hires people based on the color of their skin. Google employees are using a strange analogy involving colored coffee beans to explain and promote diversity hiring. “Do we really need to reduce people to coffee beans to understand the value of diversity?’ https://www.breitbart.com/tech/2019/08/14/project-veritas-docs-google-employees-use-coffee-beans-to-explain-diversity-hiring/"}, "660": {"name": "Thomas Shaw", "comment_text": "Google Employees Compare Enforcing U.S. Immigration Law to the Holocaust https://medium.com/@no.gcp.for.cbp/google-must-stand-against-human-rights-abuses-nogcpforcbp-88c60e1fc35e"}, "661": {"name": "Ron Old Ray Gun", "comment_text": "Qwant.com"}, "662": {"name": "Thomas Shaw", "comment_text": "A leaked document tells 45 stories of Google employees who claim they’ve experienced sexual harassment, personal insults, and racism, and were then sidelined and denied promotion for being “too much of an activist.” https://on.rt.com/a2bx"}, "663": {"name": "William Bonnie", "comment_text": "enjoy them spying on you google is not your friend along with facebook twatter"}, "664": {"name": "Ibrahim Hmood", "comment_text": "This isnt ecosia.org... What am I doing here?!"}, "665": {"name": "Ram Teja", "comment_text": "My google account was suspended 2nd time today because, I tried to help people by posting some youtube links who are seeking assistance to be free from porn and drug addiction. I wonder, the techies in google would do the same thing if their son/daughter in my situation."}, "666": {"name": "Michael Gratia", "comment_text": "Still sucks"}, "667": {"name": "Luke ✔", "comment_text": "duck.com"}, "668": {"name": "Davydd Evans", "comment_text": "The goolag search. Startpage, duckduckgo better. Yippie adds some very different general search results compared to all above. To avoid all the intersectionality BS especially the images use Baidu. Yes thats the censorious communist Chinese search engine. Do the infamous 'white couples' search Baidu is the only one showing what was searched for, couples that are white."}, "669": {"name": "newusername", "comment_text": "Don’t be evil"}, "670": {"name": "Brae Jager", "comment_text": "((()))"}, "671": {"name": "DJ T. Rumpshaker", "comment_text": "February? Buncha jigaboos? Why should we care about great achievements in rape or avoiding work?"}, "672": {"name": "Nate131084", "comment_text": "Google sucks. Use DuckDuckGo"}, "673": {"name": "Fukken Saved", "comment_text": "Why is everyone recommending DuckDuckGo? It hardly shows any results. Use metager.de instead. It works on Tor, too!"}, "674": {"name": "fubizitch", "comment_text": "Just try to google anything about vaccines anymore. Good luck searching through the hit pieces!"}, "675": {"name": "Fr33_Sp33ch", "comment_text": "I never come here BUT i had to check a users system. HONESTLY DOES GOOGLE BELIEVE THEY ARE CARBON NEUTRAL since 2007 GET FUCKING REAL. I WANT SOME PROOF....Making that claim takes balls when you know they have HUGE Data centers around the globe!"}, "676": {"name": "FuzzyDice", "comment_text": "For the record, they're literally an extension of DARPA, they were paid handsomely to create this we crawler while they were students at Stanford. This is all public knowledge, they just know that most of their idiot user base won't bother to look them up!"}, "677": {"name": "Timmy", "comment_text": "IF YOU WANT TO STOP THESE COMMUNISTS TAKING OVER THE WORLD WATCH AND SHARE EUROPA THE LAST BATTLE YOU CAN WATCH AND DOWNLOAD IT AT ARCHIVE.ORG"}, "678": {"name": "philstone", "comment_text": "See my 'how to remove covid-19 api from android' dissenter on the only result google will allow on its engine for this query. Its a video saying 'remove' rather than 'disable' which google is pushing to people who want to remove what is 'in all circumstances including google' malware in the form of spyware installed to users devices without their knowledge or consent. A cybercrime on a massive scale covered up by the google algorithm. Those trying to split hairs or defend google in this are aiding and abetting a massive crime. They want to enslave you and have no right to defence from similar crimes committed against them without their knowledge or consent. Google is evil. Its advocates are demons."}, "679": {"name": "New Zealand Free Speech Radio", "comment_text": "gay"}, "680": {"name": "Jack Sweeny", "comment_text": "LewRockwell.com TomWoods.com/Episodes TomWoods.com/CoVid RonPaulLibertyReport.com CorbettReport.com YouTube: \"Jeff Censored\"\nStay Free."}, "681": {"name": "BungyStudios", "comment_text": "This website sucks!"}, "682": {"name": "𝓛𝓾𝓴𝓮. 🗽 †", "comment_text": "BigTech is shit."}, "683": {"name": "BJ Scanlon", "comment_text": "Use DuckDuckGo or Bing. Don't reward Google for its woke censorship."}, "684": {"name": "2_56", "comment_text": "i have aids\npopcorn said 'fuck you'"}, "685": {"name": "LowAPM", "comment_text": "Never forget what your ancestors died for, you right wing bigots.\nhttps://www.youtube.com/watch?v=uRf8WfuKkEc"}, "686": {"name": "LowAPM", "comment_text": "\"Alexa why are Jews only 2% of the population but 33% of billionaires, 50% of fortune 500 board seats, 47% of university department heads?\""}, "687": {"name": "LowAPM", "comment_text": "\"Hey Dad, how many gorillion died in the Holocaust so we don't get to have borders or nationalism anymore\"\n\"Well son, however many gorillion it would take to convince you!\""}, "688": {"name": "LowAPM", "comment_text": "Google attempted to destroy my entire race and eliminate the borders of European nations and America. It still do, but it used to too :("}, "689": {"name": "LowAPM", "comment_text": "Google wants a globalist society. It wants the death of the US and Western Europe. It lobbies to flood both with the third world to destroy its culture and pride.\nDon't give in.\nhttps://www.youtube.com/watch?v=BYFjRH-vxGg&bpctr=1551295136"}, "690": {"name": "LowAPM", "comment_text": "I'm so glad our military is spending this money =)\nhttps://i.redd.it/z2ijn6wgi5j21.jpg"}, "691": {"name": "Rusty Shackleford", "comment_text": "Use Startpage.com, it uses googles search engine without reporting your info to google. DuckDuckGo is run by an ex government spook you cant trust it!"}, "692": {"name": "Kakkus Flex", "comment_text": "Say hello to my obligatory wadddaapp! 8:::::::D~\nBuy Bitcoin! https://bitcoin.org"}, "693": {"name": "LowAPM", "comment_text": "Come join likeminded people at reddit.com/r/cringeanarchy. You are not alone. There are others who are sick of 9-year old trans strippers being held up as heroes in ClownWorld."}, "694": {"name": "x2otdj95za", "comment_text": "this comment section displays a few issues this extension suffers from"}, "695": {"name": "The Carnal Conservative", "comment_text": "I like how Dissenter has the \"controversial\" tab for the wackos. Not censorship, but a merit-based relevance check. Well done Torba."}, "696": {"name": "Ron Sandoval", "comment_text": "Front Company for Mossad/CIA."}, "697": {"name": "Sean", "comment_text": "So now Chrome is telling me to disable Dissenter cuz muh bad for goy computer. Fuck you whore."}, "698": {"name": "George Mason", "comment_text": "Only came here to see the DuckDuckGo comments."}, "699": {"name": "𝕹𝖆𝖙𝖎𝖔𝖓𝖆𝖑 𝕾𝖔𝖈𝖎𝖆𝖑𝖎𝖘𝖙", "comment_text": "jewish bullshit"}, "700": {"name": "John", "comment_text": "Google is evil."}, "701": {"name": "Pro-White Porn", "comment_text": "Syrian President Bashar Al-Assad pays his respects to the victims of the Holodomor, the MAN-MADE FAMINE committed by Sergey Brin's Bolshevik forefathers against the white Ukrainian people\nhttps://i.imgur.com/kBTF88E.jpg\nNo Syrian ever called me goyim.\nSergey Brin is the Holodomor. The Holodomor is Sergey Brin."}, "702": {"name": "Pro-White Porn", "comment_text": "The push to eliminate privacy is ethnically and culturally jewish. It's as though their hooked noses are piercing through your children's bedroom windows.\nSergey Brin is the Holodomor. The Holodomor is Sergey Brin."}, "703": {"name": "Pro-White Porn", "comment_text": "Jews are bad for your mental health.\n(((Google))) waxes lyrical about protecting vulnerable individuals and marginalized groups, but it never says anything about the effects that a loss of privacy might have on such people.\nIf you're paranoid, a loss of privacy will make you more paranoid. If you're depressed, it will make you more depressed. If you're anxious, it will make you more anxious. How the hell is someone with paranoid schizophrenia, or severe anxiety, supposed to cope with the knowledge that an invisible jew is following them around, recording everything they say and do, and selling it on to whoever?\nIf anyone is struggling with these issues, please do seek help. If you see a therapist, make sure all devices are switched off so that the jew can't listen in. Hang in there, because it will be worth it. Our day will come, and if I have my way, (((Sergey Brin))) will answer for the crimes of his Bolshevik forefathers.\nSergey Brin is the Holodomor. The Holodomor is Sergey Brin."}, "704": {"name": "Hobo_milkman", "comment_text": "someone just made an Dissenter account in order to dislike all of the comments lmao"}, "705": {"name": "The cursed", "comment_text": "www.searx.me www.startpage.com www.qwant.com"}, "706": {"name": "LowAPM", "comment_text": "13 commit 50. Cya goys."}, "707": {"name": "Svigor", "comment_text": "SHALOM, JEWS! Anyone else notice how precipitously the quality of g___gle's search engine dropped off, around 5 or 10 years ago? There was a time when it really was a first rate search engine. If you knew your g__gle-fu, you could summon up all kinds of interesting , relevant political content. Now all it delivers is results approved by the (((regime)))."}, "708": {"name": "tOdD", "comment_text": "I'm going to say something unpopular. I like Google."}, "709": {"name": "John Ertz", "comment_text": "I use it every day!"}}